[
  {
    "proficiencyOptions": "[\"Animal Handling\",\"Athletics\",\"Medicine\",\"Survival\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Animal Handler\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Brawny\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Medic\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Survivalist\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Entertaining Competitor\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Linguist\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Gourmand\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Dungeon Delver\"}]}",
    "personalityTraits": "{\"diceType\":8,\"name\":\"Personality Trait\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I’m driven by a wanderlust that led me away from home.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I watch over my friends as if they were a litter of newborn pups.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I once ran twenty-five miles without stopping to warn to my clan of an approaching orc horde. I’d do it again if I had to.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I have a lesson for every situation, drawn from observing nature.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I place no stock in wealthy or well-mannered folk. Money and manners won’t save you from a hungry owlbear.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I’m always picking things up, absently fiddling with them, and sometimes accidentally breaking them.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"I feel far more comfortable around animals than people.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"I was, in fact, raised by wolves.\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"**Change**. Life is like the seasons, in constant change, and we must change with it. (Chaotic)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"**Greater Good**. It is each person’s responsibility to make the most happiness for the whole tribe. (Light)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"**Honor**. If I dishonor myself, I dishonor my whole clan. (Lawful)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"**Might**. The strongest are meant to rule. (Dark)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"**Nature**. The natural world is more important than all the constructs of civilization. (Neutral)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"**Glory**. I must earn glory in battle, for myself and my clan. (Any)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"My family, clan, or tribe is the most important thing in my life, even when they are far from me.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"An injury to the unspoiled wilderness of my home is an injury to me.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I will bring terrible wrath down on the Darkdoers who destroyed my homeland.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I am the last of my tribe, and it is up to me to ensure their names enter legend.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I suffer awful visions of a coming disaster and will do anything to prevent it.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"It is my duty to provide children to sustain my tribe.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I am too enamored of ale, wine, and other intoxicants.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"There’s no room for caution in a life lived to the fullest.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I remember every insult I’ve received and nurse a silent resentment toward anyone who’s ever wronged me.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I am slow to trust members of other species, tribes, and societies.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Violence is my answer to almost any challenge.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Don’t expect me to save those who can’t save themselves. It is nature’s way that the strong thrive and the weak perish.\"}]}",
    "name": "Nomad",
    "description": "You grew up in the wilds, far from civilization and the comforts of town and technology. You’ve witnessed the migration of herds larger than forests, survived weather more extreme than any city-dweller could comprehend, and enjoyed the solitude of being the only thinking creature for miles in any direction. The wilds are in your blood, whether you were a nomad, an explorer, a recluse, a hunter-gatherer, or even a marauder. Even in places where you don’t know the specific features of the terrain, you know the ways of the wild.",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Animal Handling, Athletics, Medicine, and Survival",
    "toolProficiencyMarkdown": "One type of musical instrument",
    "languages": 0,
    "languageMarkdown": "One of your choice",
    "equipmentMarkdown": "A walking stick, a hunting trap, a trophy from an animal you killed, a set of traveler’s clothes, and a belt pouch containing 100 cr",
    "specialityName": null,
    "specialityMarkdown": null,
    "featureName": "Wanderer",
    "featureMarkdown": "You have an excellent memory for maps and geography, and you can always recall the general layout of terrain, settlements, and other features around you. In addition, you can find food and fresh water for yourself and up to five other people each day, provided that the land offers berries, small game, water, and so forth.",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "Often considered rude and uncouth among civilized folk, nomads have little respect for the niceties of life in the cities. The ties of tribe, clan, family, and the natural world are the most important bonds to nomads.",
    "PartitionKey": "core",
    "RowKey": "04badc7a-6ef5-41d1-818d-dc9d7bea8db5",
    "Timestamp": "2018-12-27T21:18:02.3692232+00:00",
    "ETag": "W/\"datetime'2018-12-27T21%3A18%3A02.3692232Z'\""
  },
  {
    "proficiencyOptions": "[\"Lore\",\"Medicine\",\"Nature\",\"Technology\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "{\"diceType\":10,\"name\":\"Field of Research\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\" Biology\"},{\"minValue\":2,\"maxValue\":2,\"result\":\" Artificial Intelligence\"},{\"minValue\":3,\"maxValue\":3,\"result\":\" Chemistry\"},{\"minValue\":4,\"maxValue\":4,\"result\":\" Geology\"},{\"minValue\":5,\"maxValue\":5,\"result\":\" Physics\"},{\"minValue\":6,\"maxValue\":6,\"result\":\" the Force\"},{\"minValue\":7,\"maxValue\":7,\"result\":\" Astrogation\"},{\"minValue\":8,\"maxValue\":8,\"result\":\" Medicine\"}]}",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\" Loremaster \"},{\"minValue\":2,\"maxValue\":2,\"result\":\" Medic \"},{\"minValue\":3,\"maxValue\":3,\"result\":\" Naturalist \"},{\"minValue\":4,\"maxValue\":4,\"result\":\" Techie \"},{\"minValue\":5,\"maxValue\":5,\"result\":\" Biochemist \"},{\"minValue\":6,\"maxValue\":6,\"result\":\" Linguist \"},{\"minValue\":7,\"maxValue\":7,\"result\":\" Healer \"},{\"minValue\":8,\"maxValue\":8,\"result\":\" Keen Mind \"}]}",
    "personalityTraits": "{\"diceType\":8,\"name\":\"Personality Trait\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\" I look up to a renowned scientist in my field, and often talk about their work.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\" I constantly compare my current situation to my past experiments, many of which went terrifyingly wrong.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\" I believe scientific results always comes first.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\" I only speak in short incomplete and concise sentences, as they are optimized for efficient communication.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\" I often get lost in my own thoughts and contemplation, becoming oblivious to my surroundings.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\" I am unable to think logically under great stress, and begin to shout random scientific words.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\" I do not believe in etiquette and disregard social expectations.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\" I was, in fact, grown and raised in a laboratory.\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\" **Transparency.** All discoveries should be open to everyone. (Light)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\" **Logic.** Emotions must not cloud our sense of what is right and true, or our logical thinking. (Lawful)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\" **Greed.** I'm only in it for the money and fame. (Dark)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\" **Free Thinking.** Inquiry and curiosity are the pillars of progress. (Chaotic)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\" **Live and Let Live.** Meddling in the affairs of others only causes trouble. (Balanced)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\" **Aspiration.** I work hard to be the best there is at my craft. (Any)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"  My research is also my best companion.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"  I will get revenge on the criminals that stole my research.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\" The school I studied at is the most important place in the world to me.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\" One day I will return to my home planet and prove that I am the greatest scientist of them all.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\" I believe my research will be the key to saving the life of a loved one.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\" I owe my instructor a great debt for forging me into the person I am today.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\" I believe only other scientists deserve my respect.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\" I fail to understand why people don't understand my technical jargon.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\" I experiment on myself without thinking about the long term consequences.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\" I am paranoid that people are out to steal my research.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\" I believe I work better when under the influence of intoxicants.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\" I work on my research to the point where I ignore my own bodily needs.\"}]}",
    "name": "Scientist",
    "description": "Nothing excites you more than pushing the boundaries of scientific knowledge. Most of your time is spent in a lab performing experiments to further your interests. Few people understand the work you do. You can solve complex problems most people can't begin to wrap their heads around, and can solve simple problems in unexpected ways that surprise most people. \\n\\nWhat is your scientific field of interest? Is it your insatiable curiousity, or a personal goal that drives you? Did you leave your lab voluntarily, or were you kicked out? One thing is for sure - there are too many interesting research ideas, and too little time.",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Lore, Medicine, Nature, and Technology",
    "toolProficiencyMarkdown": "Biochemist's kit",
    "languages": 0,
    "languageMarkdown": "One of your choice",
    "equipmentMarkdown": "A set of common clothes, a datapad, a book on your field of research, a pouch containing 100 cr",
    "specialityName": "Field of Research",
    "specialityMarkdown": "While scientist's are widely knowledgeable, they also choose a focus for their studies. Choose an option or roll on the table below to define your field of research.",
    "featureName": "Scientific Method",
    "featureMarkdown": "You are well acquainted with your field of research from having read numerous journals or having attended scientific conferences. Concepts that are complicated, involving technical jargon that usually goes over most people's heads, are simple to you. You fully understand concepts, can recall key information, and know how to use equipment related to your field, unless the research was hidden from the public, in which you may only partially understand. You also recognize well-known figures in your field.",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "Scientist are interested in things most don't care about. Their research is their life, and drives their persornality traits. Their flaws, ideals, and bond are a result of their hours spent researching.",
    "PartitionKey": "core",
    "RowKey": "04d28c4c-3ecd-462c-8c9d-034eca9730fd",
    "Timestamp": "2018-12-24T05:15:49.8432676+00:00",
    "ETag": "W/\"datetime'2018-12-24T05%3A15%3A49.8432676Z'\""
  },
  {
    "proficiencyOptions": "[\"Investigation\",\"Insight\",\"Persuasion\",\"Performance\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Empathic\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Investigator\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Performer\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Charming Persona\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Linguist\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Actor\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Observant\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Keen Mind\"}]}",
    "personalityTraits": "{\"diceType\":8,\"name\":\"Personality Trait\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I quote the law like a religious fanatic quotes scripture.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I bang my weapon like a gavel whenever I want a rowdy group's attention.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I remain impartial when making decisions, even when I should have biases and loyalties.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Evidence is necessary to back up any claim.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I insist on settling all party disagreements through fake court proceedings.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I have to hear all sides of a story, but I secretly hate listening to people whine about how unfairly they're treated.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"I am happy to make sacrifices for the sake of fairness.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"I will not attack a person unless someone can prove they are doing something wrong.\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\" **Law.** I will follow the letter of the law always, no matter what I believe. (Lawful)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\" **Justice.** My duty is to fight for the disenfranchised underdog. (Light)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\" **Reform.** Laws can be corrupt, and I strive to free people from the bad ones. (Chaotic)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\" **Punishment.** I will punish all those who have committed great Darks. (Lawful)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\" **Control.** I enforce the law only where it benefits myself. (Dark)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\" **Stability.** The purpose of the law is to keep civilization from collapsing. That spirit of that goal is more important than the letter of the law. (Neutral)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"A dangerous criminal is on the loose, and I plan to hunt them down.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"All those who strive to uphold the law are my allies.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I have sentenced an innocent man to a horrible punishment, and the guilt still haunts me.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"There is an ethical cause that I would give my life for.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I dream of memorizing the laws of every civilization.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I am enamored with the legal system of my own culture, and want to spread its tenets everywhere.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\" Mercy is a foreign concept to me.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\" I am unwilling to admit when I am wrong.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\" I become unreasonably enraged at even the slightest injustice.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\" I expect others to adhere to the law, but I act like i am above it.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\" If there isn't a law in the books to handle a moral dilemma, I can't make a decision.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\" The punishments I deal are cruel and unusual.\"}]}",
    "name": "Lawyer",
    "description": "Your duty is to uphold the law. Before becoming an adventurer you resided over a court or tribunal, managing proceedings and sentencing criminals to punishments fit for their crimes. Your job required a deep understanding of the law which you used to resolve conflicts both clear-cut and morally grey.\\n\\nThe legal system on the planet where you worked has a large effect on how you view the law. Was it a court system with a jury making the final verdict, or did you have absolute authority over determining guilt and sentencing? Was it a fair legal system with plenty of integrity, or was it rife with abuse and corruption? Did you work on criminal cases, civil law, or something even more specific? Perhaps instead of working for a government you were a judge in an internal tribunal for a temple or military organization.\\n\\nConsider what compelled you to leave your old occupation behind and begin adventuring. Perhaps you seek to bring someone beyond the scope of law to justice, or maybe you have lost faith in the legal system altogether and have turned to a vigilante approach.",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Insight, Investigation, Performance, and Persuasion",
    "toolProficiencyMarkdown": null,
    "languages": 0,
    "languageMarkdown": "Two of your choice",
    "equipmentMarkdown": "Documentation of your station, a book of law, a formal uniform you wear to court, a set of common clothes, and a belt pouch containing 100 cr.",
    "specialityName": null,
    "specialityMarkdown": null,
    "featureName": "Legal Authority",
    "featureMarkdown": "You are familiar with the letter of the law and workings of courts, at least on the planet that you were a judge in. If you are in a foreign place where you are not familiar with their exact laws, you often will be able to track down the resources you need to learn them. \\n\\nIf you or your party gets into legal trouble, your experience may help you get out of it. If you can prove your credentials, you might be able to represent your party in a court of law without admonishment. You may know of legal loopholes that will help your case. If you are in the region where you originally worked, you might have past connections with many legal professionals there.",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "A lawyer's career is centered on issues of right, wrong, and punishment, so they will approach adventuring through a similar lens. They are used to being respected and in control, leading many of them to struggle with wild, Any situations.",
    "PartitionKey": "core",
    "RowKey": "20f076fe-c286-48fe-b926-1767d08e5cf8",
    "Timestamp": "2018-12-27T21:18:02.2511396+00:00",
    "ETag": "W/\"datetime'2018-12-27T21%3A18%3A02.2511396Z'\""
  },
  {
    "proficiencyOptions": "[\"Deception\",\"Insight\",\"Performance\",\"Sleight of Hand\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "{\"diceType\":6,\"name\":\"Scam\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I cheat at games involving chance.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I shave creds or forge documents.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I insinuate myself into people’s lives to prey on their weakness and secure their fortunes.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I put on new identities like clothes.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I run sleight-of-hand cons on street corners.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I convince people that worthless junk is worth their hard-earned money.\"}]}",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Silver-Tongued\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Empathic\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Performer\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Quick-Fingered\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Master of Disguise\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Force of Personality\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Snappy Interjection\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Actor\"}]}",
    "personalityTraits": "{\"diceType\":8,\"name\":\"Personality Trait\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I fall in and out of love easily, and am always pursuing someone.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I have a joke for every occasion, especially occasions where humor is inappropriate.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Flattery is my preferred trick for getting what I want.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I’m a born gambler who can't resist taking a risk for a potential payoff.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I lie about almost everything, even when there’s no good reason to.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Sarcasm and insults are my weapons of choice.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"I keep multiple holy symbols on me and invoke whatever deity might come in useful at any given moment.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"I pocket anything I see that might have some value.\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"**Independence.** I am a free spirit— no one tells me what to do. (Chaotic)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"**Fairness.** I never target people who can’t afford to lose a few creds. (Lawful)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"**Charity.** I distribute the money I acquire to the people who really need it. (Light)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"**Creativity.** I never run the same con twice. (Any)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"**Friendship.** Material goods come and go. Bonds of friendship last forever. (Light)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"**Aspiration.** I’m determined to make something of myself. (Any)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I fleeced the wrong person and must work to ensure that this individual never crosses paths with me or those I care about.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I owe everything to my mentor—a horrible person who’s probably rotting in jail somewhere.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Somewhere out there, I have a child who doesn’t know me. I’m making the world better for him or her.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I come from a noble family, and one day I’ll reclaim my lands and title from those who stole them from me.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"A powerful person killed someone I love. Some day soon, I’ll have my revenge.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I swindled and ruined a person who didn’t deserve it, and I seek to atone for my misdeeds.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I can’t resist a pretty face.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I'm always in debt. I spend my ill-gotten gains on decadent luxuries faster than I bring them in.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I’m convinced that no one could ever fool me the way I fool others.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I’m too greedy for my own good. I can’t resist taking a risk if there’s money involved.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I can’t resist swindling people who are more powerful than me.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I hate to admit it and will hate myself for it, but I'll run and preserve my own hide if the going gets tough.\"}]}",
    "name": "Scoundrel",
    "description": "You have always had a way with people. You can tease out their heart’s desires after a few minutes of conversation, and with a few leading questions you can read them like they were children's books. It’s a useful talent, and one that you’re perfectly willing to use for your advantage. You know what people want and you promise to deliver, coaxing people into otherwise foolish decisions. You make the improbable sound plausible, and come ahead on every deal.",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Deception, Insight, Performance, and Sleight of Hand",
    "toolProficiencyMarkdown": "Disguise Kit, Forgery Kit",
    "languages": 0,
    "languageMarkdown": null,
    "equipmentMarkdown": "A set of fine clothes, a disguise kit, a memento of a former con, and a belt pouch containing 150 cr",
    "specialityName": "Favorite Schemes",
    "specialityMarkdown": "Every scoundrel has an angle they use in preference to other schemes. Choose a favorite scam or roll on the table below.",
    "featureName": "False Identity",
    "featureMarkdown": "You have created a second identity that includes documentation, established acquaintances, and disguises that allow you to assume that persona.\\n\\nAdditionally, you can forge documents including official papers and personal letters, as long as you have seen an example of the kind of document or the handwriting you are trying to copy.",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "Scoundrels are colorful characters who conceal their true selves behind the masks they construct. They reflect what people want to see, what they want to believe, and how they see the world. But their true selves are sometimes plagued by an uneasy conscience, an old enemy, or deep-seated trust issues.",
    "PartitionKey": "core",
    "RowKey": "24bd3505-7284-4ca6-a47d-80ebb7e89b42",
    "Timestamp": "2018-12-24T05:15:49.9723603+00:00",
    "ETag": "W/\"datetime'2018-12-24T05%3A15%3A49.9723603Z'\""
  },
  {
    "proficiencyOptions": "[\"Investigation\",\"Insight\",\"Lore\",\"Persuasion\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Empathic\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Investigator\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Loremaster\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Charming Persona\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Linguist\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Crafter\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Healer\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Force Sensitive\"}]}",
    "personalityTraits": "{\"diceType\":8,\"name\":\"Personality Trait\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I idolize a particular Jedi, and constantly refer to that person’s deeds and example.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I can find common ground between the fiercest enemies, empathizing with them and always working towards peace.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I see omens in every event and action. The Force tries to speak to us, we just need to listen\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Nothing can shake my optimistic attitude.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I quote (or misquote) sacred Jedi texts and proverbs in almost every situation.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I am tolerant (or intolerant) of those who don't support the Jedi.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"I've enjoyed fine food, drink, and high society. Rough living grates on me.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"I’ve spent so long in the Jedi temple that I have little practical experience dealing with people in the  world.\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"**Tradition**. The ancient traditions of worship and sacrifice must be preserved and upheld. (Lawful)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"**Charity**. I always try to help those in need, no matter what the personal cost. (Light)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"**Change**. We must help bring about the changes the Force is constantly working in the world. (Chaotic)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"**Power**. I hope to one day rise to the rank of Jedi Master. (Lawful)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"**Faith**. I trust that the Force will guide my actions; I have faith that if I work hard, things will go well. (Lawful)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"**Aspiration**. I seek to prove myself worthy of the Force by matching my actions against the Jedi teachings. (Any)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I would die to recover an ancient Jedi relic that was lost long ago.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I will someday get revenge on those who razed my temple.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I owe my life to the Jedi who took me in when my parents died.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Everything I do is for the common people.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I will do anything to protect the temple where I served.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I seek to preserve a sacred text that my enemies seek to destroy.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I judge others harshly, and myself even more severely.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I put too much trust in those who wield power within my temple’s hierarchy.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"My piety sometimes leads me to blindly trust those that profess faith in the Force.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I am inflexible in my thinking.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I am suspicious of strangers and expect the worst of them.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Once I pick a goal, I become obsessed with it to the detriment of everything else in my life.\"}]}",
    "name": "Jedi",
    "description": "You are a devout follower of the Jedi Order: an ancient, monastic peacekeeping organization united in its observance of the light side of the Force. A noble order of protectors noted for their ability to tap into the power of the Force, the Jedi serve as guardians of peace and justice in the Galactic Republic. You follow the Jedi Code:\\n\\n*\"There is no emotion, there is peace.*\\n*There is no ignorance, there is knowledge.*\\n*There is no passion, there is serenity.*\\n*There is no chaos, there is harmony.*\\n*There is no death, there is the Force.\"*",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Insight, Investigation, Lore, and Persuasion",
    "toolProficiencyMarkdown": "Artificer's tools",
    "languages": 0,
    "languageMarkdown": "One of your choice",
    "equipmentMarkdown": "A copy of the Jedi code, a set of common clothes including a robe, and a belt pouch containing 150 cr",
    "specialityName": null,
    "specialityMarkdown": null,
    "featureName": "Shelter of the Faithful",
    "featureMarkdown": "As a Jedi, you command the respect of those who are loyal to the Jedi Order. You and your adventuring companions can expect to receive free healing and care at any Jedi temple, and those who support your religion will support you (but only you) at a modest lifestyle.\\n\\nYou might also have ties to a specific Jedi temple and have a residence there. This could be the temple where you trained, or a temple where you have found a new home. While near your temple, you can call upon the Jedi for assistance, provided the assistance you ask for is not hazardous and you remain in good standing with your temple.",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "Jedi are shaped by their experience in their temple. Their study of the history and tenets of the Jedi Order and their relationships to temples, shrines, or hierarchies affect their mannerisms and ideals. Their flaws might be some hidden hypocrisy or heretical idea, or an ideal or bond taken to an extreme.",
    "PartitionKey": "core",
    "RowKey": "35da2eb8-9e4a-4bd5-a6ba-dd8aeb1521d4",
    "Timestamp": "2018-12-24T05:15:49.3829405+00:00",
    "ETag": "W/\"datetime'2018-12-24T05%3A15%3A49.3829405Z'\""
  },
  {
    "proficiencyOptions": "[\"Animal Handling\",\"Lore\",\"Medicine\",\"Nature\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "{\"diceType\":8,\"name\":\"Life of Seclusion\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I was partaking of communal living in accordance with the dictates of a religious order.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I retreated from society after a life-altering event.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I needed a quiet place to work on my art, literature, music, or manifesto.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I needed to commune with nature, far from civilization.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I was the caretaker of an ancient ruin or relic.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I was in search of a place of spiritual significance.\"}]}",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Animal Handler\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Loremaster\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Medic\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Naturalist\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Herbalist\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Alert\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Dungeon Delver\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Healer\"}]}",
    "personalityTraits": "{\"diceType\":8,\"name\":\"Personality Trait\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I’ve been isolated for so long that I rarely speak, preferring gestures and the occasional grunt.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I am utterly serene, even in the face of disaster.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"The leader of my community had something wise to say on every topic, and I am eager to share that wisdom.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I feel tremendous empathy for all who suffer.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I’m oblivious to etiquette and social expectations.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I connect everything that happens to me to a grand, cosmic plan.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"I often get lost in my own thoughts and contemplation, becoming oblivious to my surroundings.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"I am working on a grand philosophical theory and love sharing my ideas.\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"**Greater Good**. My gifts are meant to be shared with all, not used for my own benefit. (Light)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"**Logic**. Emotions must not cloud our sense of what is right and true, or our logical thinking. (Lawful)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"**Free Thinking.** Inquiry and curiosity are the pillars of progress. (Chaotic)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"**Power**. Solitude and contemplation are paths toward mystical power. (Dark)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"**Live and Let Live**. Meddling in the affairs of others only causes trouble. (Neutral)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"**Self-Knowledge**. If you know yourself, there’s nothing left to know. (Any)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Nothing is more important than the other members of my hermitage, order, or association.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I entered seclusion to hide from the ones who might still be hunting me. I must someday confront them.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I’m still seeking the enlightenment I pursued in my seclusion, and it still eludes me.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I entered seclusion because I loved someone I could not have.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Should my discovery come to light, it could bring ruin to the world.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"My isolation gave me great insight into a great Dark that only I can destroy.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Now that I've returned to the world, I enjoy its delights a little too much.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I harbor dark, bloodthirsty thoughts that my isolation and meditation failed to quell.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I am dogmatic in my thoughts and philosophy.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I let my need to win arguments overshadow friendships and harmony.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I’d risk too much to uncover a lost bit of knowledge.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I like keeping secrets and won’t share them with anyone.\"}]}",
    "name": "Hermit",
    "description": "You lived in seclusion—either in a community or alone—for a formative part of your life. In your time apart from society, you found quiet, solitude, and perhaps some of the answers you were looking for.",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Animal Handling, Lore, Medicine, and Nature",
    "toolProficiencyMarkdown": "Herbalism kit",
    "languages": 0,
    "languageMarkdown": "One of your choice",
    "equipmentMarkdown": "A diary of your experiences, a winter blanket, a set of common clothes, an herbalism kit, and 50 cr",
    "specialityName": "Life of Seclusion",
    "specialityMarkdown": "What was the reason for your isolation, and what changed to allow you to end your solitude? You can work with your DM to determine the exact nature of your seclusion, or you can choose or roll on the table below to determine the reason behind your seclusion.",
    "featureName": "Discovery",
    "featureMarkdown": "The seclusion of your hermitage gave you access to a unique and powerful discovery. The nature of this revelation depends on the nature of your seclusion. You might have discoved a great truth about the cosmos or the Force, a fact that has long been forgotten, a relic of the past that could rewrite history, or a place unseen for ages. It might be information that would be damaging to the people who or consigned you to exile, and hence the reason for your return to society. Work with your DM to determine the details of your discovery and its impact on the campaign.",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "Some hermits are well suited to a life of seclusion, whereas others chafe against it and long for company. Whether they embrace solitude or long to escape it, the solitary life shapes their attitudes and ideals. Some few are driven slightly mad by their isolation.",
    "PartitionKey": "core",
    "RowKey": "47a20409-bc68-4b0e-afba-c74cb33aca7b",
    "Timestamp": "2018-12-27T21:18:01.8488563+00:00",
    "ETag": "W/\"datetime'2018-12-27T21%3A18%3A01.8488563Z'\""
  },
  {
    "proficiencyOptions": "[\"Acrobatics\",\"Athletics\",\"Intimidation\",\"Performance\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Acrobatics\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Brawny\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Threatening\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Performer\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Entertaining Competitor\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Linguist\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Durable\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Martial Adept\"}]}",
    "personalityTraits": "{\"diceType\":8,\"name\":\"Personality Trait\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I know a story relevant to almost every situation.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Whenever I come to a new place, I collect local rumors and spread gossip.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I’m a hopeless romantic, always searching for that “special someone.”\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Nobody stays angry at me or around me for long, since I can defuse any amount of tension.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I love a good insult, even one directed at me.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I get bitter if I’m not the center of attention.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"I’ll settle for nothing less than perfection.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"I change my mood or my mind as quickly as I change key in a song.\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"**Beauty**. When I perform, I make the world better than it was. (Light)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"**Tradition**. The stories, legends, and songs of the past must never be forgotten, for they teach us who we are. (Lawful)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"**Creativity**. The world is in need of new ideas and bold action. (Chaotic)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"**Greed**. I’m only in it for the money and fame. (Dark)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"**People**. I like seeing the smiles on people’s faces when I perform. That’s all that matters. (Neutral)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"**Honesty**. Art should reflect the soul; it should come from within and reveal who we really are. (Any)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"My instrument is my most treasured possession, and it reminds me of someone I love.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Someone stole my precious trophy, and someday I’ll get it back.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I want to be famous, whatever it takes.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I idolize a hero of the old tales and measure my deeds against that person’s.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I will do anything to prove myself superior to my hated rival.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I would do anything for the other members of my old troupe.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I’ll do anything to win fame and renown.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I’m a sucker for a pretty face.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"A scandal prevents me from ever going home again. That kind of trouble seems to follow me around.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I once satirized a noble who still wants my head. It was a mistake that I will likely repeat.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I have trouble keeping my true feelings hidden. My sharp tongue lands me in trouble.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Despite my best efforts, I am unreliable to my friends.\"}]}",
    "name": "Gladiator",
    "description": "A gladiator is as much an entertainer as any minstrel or circus performer, trained to make the arts of combat into a spectacle the crowd can enjoy. This kind of flashy combat is your entertainer routine, though you might also have some skills as a tumbler or actor. Using your A Champion Well Known feature, you can find a place to perform in any place that features combat for entertainment—perhaps a gladiatorial arena or secret pit fighting club.",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Acrobatics, Athletics, Intimidation, and Performance",
    "toolProficiencyMarkdown": "One type of musical instrument",
    "languages": 0,
    "languageMarkdown": "One of your choice",
    "equipmentMarkdown": "A trophy earned via some sort of competition, clothing suitable to your profession, and a belt pouch containing 150 cr",
    "specialityName": null,
    "specialityMarkdown": null,
    "featureName": "A Champion Well Known",
    "featureMarkdown": "You can always find a place to perform, usually in an inn or tavern but possibly with a circus, at a theater, or even in a noble’s court. At such a place, you receive free lodging and food of a modest or comfortable standard (depending on the quality of the establishment), as long as you perform each night. In addition, your performance makes you something of a local figure. When strangers recognize you in a town where you have performed, they typically take a liking to you.",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "Successful entertainers have to be able to capture and hold an audience’s attention, so they tend to have flamboyant or forceful personalities. They’re inclined toward the romantic and often cling to high-minded ideals about the practice of art and the appreciation of beauty.",
    "PartitionKey": "core",
    "RowKey": "48689842-d6a7-4da7-8e8e-ca7ca2cf050f",
    "Timestamp": "2018-12-27T21:18:01.1833872+00:00",
    "ETag": "W/\"datetime'2018-12-27T21%3A18%3A01.1833872Z'\""
  },
  {
    "proficiencyOptions": "[\"Acrobatics\",\"Athletics\",\"Insight\",\"Survival\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "{\"diceType\":10,\"name\":\"Defining Event\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I stood up to a tyrant's agents.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I stole from a corrupt Lord to help the poor.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I broke into a tyrant's castle and stole weapons to arm the people.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I failed to assassinate a tyrant.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I loved a noble, and was caught in bed with them.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I robbed a bank with unfair interest rates.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"I murdered a pedophilic priest to save local children.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"I received a heroic calling from a mysterious creature.\"},{\"minValue\":9,\"maxValue\":9,\"result\":\"I was framed for a crime I didn't commit.\"},{\"minValue\":10,\"maxValue\":10,\"result\":\"Outlaw by choice.\"}]}",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Acrobat\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Brawny\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Empathic\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Survivalist\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Master of Disguise\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Linguist\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Observant\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Entertaining Competitor\"}]}",
    "personalityTraits": "{\"diceType\":8,\"name\":\"Personality Trait\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I judge people by their actions, not their words.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"If someone is in trouble, I’m always ready to lend help.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"When I set my mind to something, I follow through no matter what gets in my way.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I have a strong sense of fair play and always try to find the most equitable solution to arguments.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I’m confident in my own abilities and do what I can to instill confidence in others.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Thinking is for other people. I prefer action.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"I misuse long words in an attempt to sound smarter.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"I get bored easily. When am I going to get on with my destiny?\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"**Respect.** People deserve to be treated with dignity and respect. (Light)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"**Fairness.** No one should get preferential treatment before the law, and no one is above the law. (Lawful)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"**Freedom.** Tyrants must not be allowed to oppress the people. (Chaotic)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"**Might.** If I become strong, I can take what I want—what I deserve. (Dark)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"**Sincerity.** There’s no good in pretending to be something I’m not. (Neutral)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"**Destiny.** Nothing and no one can steer me away from my higher calling. (Any)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I have a family, but I have no idea where they are. One day, I hope to see them again.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I worked the land, I love the land, and I will protect the land.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"A proud noble once gave me a horrible beating, and I will take my revenge on any bully I encounter.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"My tools are symbols of my past life, and I carry them so that I will never forget my roots.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I protect those who cannot protect themselves.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I wish my childhood sweetheart had come with me to pursue my destiny.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"The tyrant who rules my land will stop at nothing to see me killed.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I’m convinced of the significance of my destiny, and blind to my shortcomings and the risk of failure.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"The people who knew me when I was young know my shameful secret, so I can never go home again.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I have a weakness for the vices of the city, especially hard drink.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Secretly, I believe that things would be better if I were a tyrant lording over the land.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I have trouble trusting in my allies.\"}]}",
    "name": "Outlaw",
    "description": "You are a notorious free adventurer who, due to unfortunate circumstances, has lost favor with the law. However, being of the common people, they protect you due to your just nature. A protector of the people, a thorn in the side of authorities.",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Acrobatics, Athletics, Insight, and Survival",
    "toolProficiencyMarkdown": "Disguise kit",
    "languages": 0,
    "languageMarkdown": "One of your choice",
    "equipmentMarkdown": "A hunting trap, an iron pot, a set of traveler's clothes, and a pouch containing 150 cr",
    "specialityName": "Defining Event",
    "specialityMarkdown": "Though you were once just a common civilian, a specific happening caused you to drastically change your lifestyle and take off for a life of dangerous wondering and in some cases revenge. Choose or randomly determine a defining event that marked you as an outlaw.",
    "featureName": "Notorious",
    "featureMarkdown": "Since you come from the ranks of the common folk, you fit among them with ease. You can find a place to hide, rest, or recuperate among other commoners, unless you've shown yourself to be a danger to them. They will shield you from the law or anyone else searching for you, though they will not risk their lives for you.",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "An outlaw is a hero for the common people who takes pride in his humble origins and revels in disrupting authority to help those he's close to.",
    "PartitionKey": "core",
    "RowKey": "4936c7f7-6003-4e8b-87d9-61d87242b169",
    "Timestamp": "2018-12-27T21:18:02.4883071+00:00",
    "ETag": "W/\"datetime'2018-12-27T21%3A18%3A02.4883071Z'\""
  },
  {
    "proficiencyOptions": "[\"Animal Handling\",\"Athletics\",\"Nature\",\"Performance\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "{\"diceType\":8,\"name\":\"Defining Event\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I stood up to a tyrant’s agents.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I saved people during a natural disaster.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I stood alone against a terrible monster.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I stole from a corrupt merchant to help the poor.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I led a militia to fight off an invading army.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I broke into a tyrant’s castle and stole weapons to arm the people.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"I trained the peasantry to use farm implements as weapons against a tyrant’s soldiers.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"A lord rescinded an unpopular decree after I led a symbolic act of protect against it.\"}]}",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Animal Handler\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Brawny\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Naturalist\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Performer\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Crafter\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Gourmand\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Biochemist\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Healer\"}]}",
    "personalityTraits": "{\"diceType\":8,\"name\":\"Personality Trait\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I judge people by their actions, not their words.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"If someone is in trouble, I’m always ready to lend help.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"When I set my mind to something, I follow through no matter what gets in my way.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I have a strong sense of fair play and always try to find the most equitable solution to arguments.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I’m confident in my own abilities and do what I can to instill confidence in others.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Thinking is for other people. I prefer action.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"I misuse long words in an attempt to sound smarter.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"I get bored easily. When am I going to get on with my destiny?\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"**Respect**. People deserve to be treated with dignity and respect. (Light)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"**Fairness**. No one should get preferential treatment before the law, and no one is above the law. (Lawful)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"**Freedom**. Tyrants must not be allowed to oppress the people. (Chaotic)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"**Might**. If I become strong, I can take what I want—what I deserve. (Dark)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"**Sincerity**. There’s no good in pretending to be something I’m not. (Neutral)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"**Destiny**. Nothing and no one can steer me away from my higher calling. (Any)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I have a family, but I have no idea where they are. One day, I hope to see them again.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I worked the land, I love the land, and I will protect the land.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"A proud noble once gave me a horrible beating, and I will take my revenge on any bully I encounter.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"My tools are symbols of my past life, and I carry them so that I will never forget my roots.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I protect those who cannot protect themselves.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I wish my childhood sweetheart had come with me to pursue my destiny.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"The tyrant who rules my land will stop at nothing to see me killed.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I’m convinced of the significance of my destiny, and blind to my shortcomings and the risk of failure.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"The people who knew me when I was young know my shameful secret, so I can never go home again.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I have a weakness for the vices of the city, especially hard drink.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Secretly, I believe that things would be better if I were a tyrant lording over the land.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I have trouble trusting in my allies.\"}]}",
    "name": "Folk Hero",
    "description": "You come from a humble social rank, but you are destined for so much more. Already the people of your home village regard you as their champion, and your destiny calls you to stand against the tyrants and monsters that threaten the common folk everywhere.",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Animal Handling, Athletics, Nature, and Performance",
    "toolProficiencyMarkdown": "One type of artisan’s tools, biochemist's kit, or chef's kit",
    "languages": 0,
    "languageMarkdown": "One of your choice",
    "equipmentMarkdown": "A set of tools (one of your choice), a set of common clothes, and a belt pouch containing 100 cr",
    "specialityName": "Defining Event",
    "specialityMarkdown": "You previously pursued a simple profession among the peasantry, perhaps as a farmer or miner, servant or shepherd. But something happened that set you on a different path and marked you for greater things. Choose or randomly determine a defining event that marked you as a hero of the people.",
    "featureName": "Rustic Hospitality",
    "featureMarkdown": "Since you are of the common folk, you fit in among them with ease. You can find a place to hide, rest, or recuperate among other commoners, unless you have shown yourself to be a danger to them. They will shield you from the law or anyone else searching for you, though they will not risk their lives for you.",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "A folk hero is one of the common people, for better or for worse. Most folk heroes look on their humble origins as a virtue, not a shortcoming, and their home communities remain very important to them.",
    "PartitionKey": "core",
    "RowKey": "50d3a75e-34d7-49fd-8bab-4733162f41be",
    "Timestamp": "2018-12-27T21:18:01.0582995+00:00",
    "ETag": "W/\"datetime'2018-12-27T21%3A18%3A01.0582995Z'\""
  },
  {
    "proficiencyOptions": "[\"Deception\",\"Insight\",\"Intimidation\",\"Persuasion\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "{\"diceType\":8,\"name\":\"Motivation\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Desperation\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Freedom\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Infamy\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Love\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Malice\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Profit\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Respect\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Revenge\"}]}",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Silver-Tongued\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Empathic\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Threatening\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Charming Persona\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Entertaining Competitor\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Linguist\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Inspiring Leader\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Observant\"}]}",
    "personalityTraits": "{\"diceType\":8,\"name\":\"Personality Trait\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I always have a plan for what to do when things go wrong.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I am always calm, no matter what the situation. I never raise my voice or let me emotions control me.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"My eloquent flattery makes everyone I talk to feel like the most wonderful and important person in the world.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I would rather make a new friend than a new enemy.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I don’t like to get my hands dirty, and I won’t be caught dead in unsuitable accommodations.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"My favor, once lost, is lost forever.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"If you do me an injury, I will crush you, ruin your name, and salt your fields.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"I blow up at the slightest insult.\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"**Honor**. I don’t steal from others in the trade. (Lawful)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"**Freedom**. Chains are meant to be broken, as are those who would forge them. (Chaotic)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"**Charity**. I steal from the wealthy so that I can help people in need. (Light)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"**Greed**. I will do whatever it takes to become wealthy. (Dark)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"**People**. I’m loyal to my friends, not to any ideals, and everyone else can take a trip down the Styx for all I care. (Neutral)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"**Redemption**. There’s a spark of good in everyone. (Light)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I’m trying to pay off an old debt I owe to a generous benefactor.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"My ill-gotten gains go to support my family.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Something important was taken from me, and I aim to steal it back.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"The common folk must see me as a hero of the people.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I’m guilty of a terrible crime. I hope I can redeem myself for it.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Someone I loved died because of a mistake I made. That will never happen again.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I secretly believe that everyone is beneath me.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"When faced with a choice between money and my friends, I usually choose the money.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I too often hear veiled insults and threats in every word addressed to me, and I’m quick to anger.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I have a “tell” that reveals when I'm lying.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I turn tail and run when things look bad.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"An innocent person is in prison for a crime that I committed. I’m okay with that.\"}]}",
    "name": "Crime Lord",
    "description": "Few societies manage to eradicate crime altogether. In the underworld, someone always rises to the top, either through vision, organisation, or sheer intimidation. The life of a crime lord isn't for the timid. After conquering an unseen empire, the crime lord wages a daily struggle not only to stay on top, but also to stay alive.",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Deception, Insight, Intimidation, and Persuasion",
    "toolProficiencyMarkdown": "One type of gaming set",
    "languages": 0,
    "languageMarkdown": "One of your choice",
    "equipmentMarkdown": "A fine set of clothes, a gaming set (one of your choice), and a purse containing 250 cr",
    "specialityName": "Criminal Motivation",
    "specialityMarkdown": "Of course, not every crime lord is bent on corrupting society and making a profit. Some use their criminal connections to wage guerilla wars against tyrants and despots. Indeed, some of the lesser-known heroes of the Rebellion began as smugglers or pirates, and eventually rose through the ranks of their organisation to provide a more noble direction for their groups' activities. Although some did so to remove an obstacle to making more money, others recognised that ridding the galaxy of the Empire's evil was a more important long-term goal. Choose the motivation behind your criminal enterprise, or roll on the table below.",
    "featureName": "Criminal Network",
    "featureMarkdown": "You have access to an extensive network of organised crime. You know how to get messages to and from local contacts, even over great distances; specifically, you know the local messengers, corrupt caravan masters, and seedy sailors who can deliver messages for you.",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "Crime lords might seem like villains on the surface, and many of them are villainous to the core. But some have an abundance of endearing, if not redeeming, characteristics. Unlike common thieves, some crime lords even have some respect for law and authority, with whom they play a cat-and-mouse type game. ",
    "PartitionKey": "core",
    "RowKey": "5c112377-a085-4c05-b949-e869bfeaba25",
    "Timestamp": "2018-12-27T21:18:00.7590888+00:00",
    "ETag": "W/\"datetime'2018-12-27T21%3A18%3A00.7590888Z'\""
  },
  {
    "proficiencyOptions": "[\"Deception\",\"Insight\",\"Lore\",\"Persuasion\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Silver-Tongued\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Empathic\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Loremaster\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Charming Persona\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Entertaining Competitor\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Linguist\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Inspiring Leader\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Observant\"}]}",
    "personalityTraits": "{\"diceType\":8,\"name\":\"Personality Trait\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"My eloquent flattery makes everyone I talk to feel like the most wonderful and important person in the world.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"The common folk love me for my kindness and generosity.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"No one could doubt by looking at my regal bearing that I am a cut above the unwashed masses.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I take great pains to always look my best and follow the latest fashions.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I don’t like to get my hands dirty, and I won’t be caught dead in unsuitable accommodations.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Despite my noble birth, I do not place myself above other folk. We all have the same blood.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"My favor, once lost, is lost forever.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"If you do me an injury, I will crush you, ruin your name, and salt your fields.\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"**Respect**. Respect is due to me because of my position, but all people regardless of station deserve to be treated with dignity. (Light)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"**Responsibility**. It is my duty to respect the authority of those above me, just as those below me must respect mine. (Lawful)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"**Independence**. I must prove that I can handle myself without the coddling of my family. (Chaotic)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"**Power**. If I can attain more power, no one will tell me what to do. (Dark)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"**Family**. Blood runs thicker than water. (Any)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"**Noble Obligation**. It is my duty to protect and care for the people beneath me. (Light)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I will face any challenge to win the approval of my family.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"My house’s alliance with another noble family must be sustained at all costs.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Nothing is more important than the other members of my family.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I am in love with the heir of a family that my family despises.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"My loyalty to my sovereign is unwavering.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"The common folk must see me as a hero of the people.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I secretly believe that everyone is beneath me.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I hide a truly scandalous secret that could ruin my family forever.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I too often hear veiled insults and threats in every word addressed to me, and I’m quick to anger.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I have an insatiable desire for carnal pleasures.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"In fact, the world does revolve around me.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"By my words and actions, I often bring shame to my family.\"}]}",
    "name": "Noble",
    "description": "You understand wealth, power, and privilege. You carry a noble title, and your family owns land, collects taxes, and wields significant political influence. You might be a pampered aristocrat unfamiliar with manual labor, a former merchant just elevated to the nobility, or an honest, hard-working landowner who cares deeply about the people who live and work on your land.\\n\\nWork with your DM to come up with an appropriate title and determine how much authority that title carries, as well as your family and their influence on you. Is your family old and established, or was your title only recently bestowed? How much influence do they wield, how do people regard them?\\n\\nWhat’s your position in the family? Are you the heir to the head of the family or the head itself? Are you far down the line of succession? How does the head of your family feel about your adventuring career? Are you in your family’s good graces, or shunned by the rest of your family?\\n\\nDoes your family have a coat of arms you might wear, a signet ring, or particular colors? \\n\\nThese details help establish your family and your title as features of the world of the campaign.",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Deception, Insight, Lore, and Persuasion",
    "toolProficiencyMarkdown": "One type of gaming set",
    "languages": 0,
    "languageMarkdown": "One of your choice",
    "equipmentMarkdown": "A set of fine clothes, a signet ring, a letter of pedigree, and a purse containing 250 cr",
    "specialityName": null,
    "specialityMarkdown": null,
    "featureName": "Position of Privilege",
    "featureMarkdown": "Thanks to your noble birth, people are inclined to think the best of you. You are welcome in high society, and people assume you have the right to be wherever you are. The common folk make every effort to accommodate you and avoid your displeasure, and other people of high birth treat you as a member of the same social sphere. You can secure an audience with a local noble if you need to.",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "Nobles are born and raised to a very different lifestyle than most people ever experience, and their personalities reflect that upbringing. A noble title comes with a plethora of bonds—responsibilities to family, to other nobles (including the sovereign), to the people entrusted to the family’s care, or even to the title itself. But this responsibility is often a good way to undermine a noble.",
    "PartitionKey": "core",
    "RowKey": "5e5d24f4-f189-483c-b0e5-47fd05180dca",
    "Timestamp": "2018-12-24T05:15:49.7291865+00:00",
    "ETag": "W/\"datetime'2018-12-24T05%3A15%3A49.7291865Z'\""
  },
  {
    "proficiencyOptions": "[\"Athletics\",\"Investigation\",\"Nature\",\"Survival\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Brawny\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Investigator\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Naturalist\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Survivalist\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Demolitionist\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Bypasser\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Slicer\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Linguist\"}]}",
    "personalityTraits": "{\"diceType\":8,\"name\":\"Personality Trait\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I can't bring myself to ignore a cry for help.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I hold onto every mildly interesting item I find, in case it comes in handy someday.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"After all the weirdness I've seen on my travels, nothing can surprise me.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I spit and laugh in the face of danger.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Giving up is never an option for me.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I feel more at home in monster-infested dungeons than in civilized society.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"I fill silence with wacky stories about my past misadventures, which may or may not be exaggerated.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"My sense of humor is as dark and grim as the dungeons I explore.\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\" **Adventure.** All I want is to travel the world and see amazing things. (Any)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\" **Heroism.** I am dedicated to helping people in need. (Light)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\" **Order.** I use my power to save the world from the forces of destruction and chaos. (Lawful)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\" **Excitement.** An ordinary life is boring, I'd rather travel around and find trouble. (Chaotic)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\" **Power.** The more powerful enemies I defeat, the stronger I become. (Neutral)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\" **Aspiration.** I want to go down in history as a brave, powerful hero. (Any)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\" I carry with me a strange artifact that I found in a dungeon, but I don't know what it's for.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\" My adventuring party means the world to me.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\" I have sworn to hunt down the monster or villain who killed my former adventuring party.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\" I adventure in order to bring honor (or money) to my family.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\" There is a faraway place I've always wanted to visit, and I won't stop until I make it there.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\" All I want is to make the ones who trained me in the way of adventuring proud.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\" I default to solving problems with violence even when it's unwise or immoral.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\" I expect to be lavished with praise whenever I do my job, and I get mad when no one acknowledges me.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\" All members of \\\"Dark\\\" species must be Dark, so I will never trust them.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\" Waiting around makes me antsy. I'd rather do something stupid than do nothing at all.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\" My habit of looting dungeons makes me swipe things I shouldn't.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\" A monstrous enemy I faced in the past still leaves me quivering with fear.\"}]}",
    "name": "Guild Adventurer",
    "description": "Adventuring is nothing new to you. Due to the circumstances of how you were raised, you have been involved with wandering heroes for most of your life. Maybe you were part of an adventuring band previously, but split with them after a disagreement or tragedy. Or, perhaps you worked around heroes in a lesser role for most of your young life, and you are now ready to graduate to the front lines.",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Athletics, Investigation, Nature, and Survival",
    "toolProficiencyMarkdown": "Your choice demolitions kit, security kit, or slicer's kit",
    "languages": 0,
    "languageMarkdown": "One of your choice",
    "equipmentMarkdown": "50 feet of rope, a small knife, a trophy, a set of traveler's clothes, and a belt pouch containing 100 cr.",
    "specialityName": null,
    "specialityMarkdown": null,
    "featureName": "Guild Membership",
    "featureMarkdown": "You are an established and respected member of an adventurer's guild, allowing you to rely on certain benefits that membership provides. If you are in a town with a headquarters for your adventurer's guild and you are in good standing with the guild, you will be allowed to look at the job postings and find adventuring work to earn money. \\n\\nGuilds often wield tremendous political power. If you are accused of a crime, your guild will support you if a good case can be made for your innocence or the crime is justifiable. You can also gain access to powerful political figures through the guild, if you are a member in good standing. You must pay dues of 50 cr per month to the guild. Your dues must be current to remain in the guild’s good graces.",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "Adventurers are well adjusted to life on the road. They are often comfortable doing dangerous things like dungeoneering and fighting and can stay level-headed in the face of danger, but they may not be so well adapted to other parts of life.",
    "PartitionKey": "core",
    "RowKey": "611586b4-e0d7-4aad-88c0-c5f8ffbe568d",
    "Timestamp": "2018-12-27T21:18:01.3424997+00:00",
    "ETag": "W/\"datetime'2018-12-27T21%3A18%3A01.3424997Z'\""
  },
  {
    "proficiencyOptions": "[\"Investigation\",\"Insight\",\"Piloting\",\"Technology\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "{\"diceType\":8,\"name\":\"Specialty\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Pilot\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Mechanic\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Support Staff\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Guard\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Ship Medic\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Captain\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Communications Officer\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Ship Cook\"}]}",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Empathic\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Investigator\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Ace Pilot\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Techie\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Gourmand\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Genius Mechanic\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Entertaining Competitor\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Inspiring Leader\"}]}",
    "personalityTraits": "{\"diceType\":8,\"name\":\"Personality Trait\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"My crewmates know they can rely on me, no matter what.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I work hard so that I can play hard when the work is done.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I enjoy traveling into new systems and making new friends over a drink.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I stretch the truth for the sake of a good story.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"To me, a bar brawl is a nice way to get to know a new city.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I never pass up a friendly wager.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"The best way to get me to do something is to tell me I can’t do it.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"I like a job well done, especially if I can convince someone else to do it.\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"**Respect**. The thing that keeps a ship together is mutual respect between captain and crew. (Light)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"**Fairness**. We all do the work, so we all share in the rewards. (Lawful)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"**Freedom**. Space is freedom — the freedom to go anywhere and do anything. (Chaotic)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"**Mastery**. I'm a predator, and the other ships we come across are my prey. (Dark)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"**People**. I'm committed to my crewmates, not to ideals. (Neutral)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"**Aspiration**. Someday, I'll own my own ship and chart my own destiny. (Any)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I'm loyal to my captain first, everything else second.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"The ship is most important—crewmates and captains come and go.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I'll always remember my first ship.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I will become the greatest captain that ever lived.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I was cheated out of my fair share of the profits, and I want to get my due.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Ruthless space pirates murdered my captain and crewmates, stole all we owned, and left me lo die. Vengeance will be mine.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"\\tI follow orders, even if I think they're wrong.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"\\tI'll say anything to avoid having to do extra work.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Once someone questions my courage, I never back down no matter how dangerous the situation.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"\\tOnce I start drinking, it's hard for me to stop.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"\\tI can't help but pocket loose coins and other trinkets I come across.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"My pride will probably lead to my destruction.\"}]}",
    "name": "Spacer",
    "description": "Aboard a star ship in the cold vacuum of space is where you feel most at home. You've spent the majority of your life travelling the stars. Life aboard ships has given you a good understanding of their inner workings. You might be especially skilled as a ship mechanic, a pilot, or support staff.",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Insight, Investigation, Piloting, and Technology",
    "toolProficiencyMarkdown": "Your choice of chef's kit, mechanic's kit, or one type of gaming set",
    "languages": 0,
    "languageMarkdown": "One of your choice",
    "equipmentMarkdown": "A set of tools or a gaming set (one of your choice), a set of common clothes, a small souvenir from your travels, and a belt pouch containing 100 cr",
    "specialityName": "Specialty",
    "specialityMarkdown": "During your time as a spacer, you had a specific role to play aboard the ship. Roll a d8 or choose from the options in the table below to determine your role:",
    "featureName": "Well-Traveled",
    "featureMarkdown": "As a spacer, you've been from one end of the galaxy to the other. You've traveled along many of the trade routes, and know the safest routes. You have expert knowledge of the various hyperlanes. In addition to this, you know a large number of the models and designs of common space ships that are found in the galaxy.",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "Spacers come from all walks of life, and the responsibilities of life aboard a ship make them generally reliable as well. Spending so much time on their ship shapes their outlook and forms their most important attachments.",
    "PartitionKey": "core",
    "RowKey": "6591131a-bab3-4a21-8b27-f762d0a9b137",
    "Timestamp": "2018-12-24T05:15:50.4807216+00:00",
    "ETag": "W/\"datetime'2018-12-24T05%3A15%3A50.4807216Z'\""
  },
  {
    "proficiencyOptions": "[\"Acrobatics\",\"Insight\",\"Performance\",\"Sleight of Hand\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "{\"diceType\":10,\"name\":\"Entertainer Routine\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Actor\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Dancer\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Fire-eater\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Jester\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Juggler\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Instrumentalist\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Poet\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Singer\"},{\"minValue\":9,\"maxValue\":9,\"result\":\"Storyteller\"},{\"minValue\":10,\"maxValue\":10,\"result\":\"Tumbler\"}]}",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Acrobat\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Empathic\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Performer\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Quick-Fingered\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Master of Disguise\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Entertaining Competitor\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Practiced\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Actor\"}]}",
    "personalityTraits": "{\"diceType\":8,\"name\":\"Personality Trait\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I know a story relevant to almost every situation.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Whenever I come to a new place, I collect local rumors and spread gossip.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I’m a hopeless romantic, always searching for that “special someone.”\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Nobody stays angry at me or around me for long, since I can defuse any amount of tension.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I love a good insult, even one directed at me.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I get bitter if I’m not the center of attention.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"I’ll settle for nothing less than perfection.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"I change my mood or my mind as quickly as I change key in a song.\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"**Beauty**. When I perform, I make the world better than it was. (Light)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"**Tradition**. The stories, legends, and songs of the past must never be forgotten, for they teach us who we are. (Lawful)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"**Creativity**. The world is in need of new ideas and bold action. (Chaotic)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"**Greed**. I’m only in it for the money and fame. (Dark)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"**People**. I like seeing the smiles on people’s faces when I perform. That’s all that matters. (Neutral)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"**Honesty**. Art should reflect the soul; it should come from within and reveal who we really are. (Any)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"My instrument is my most treasured possession, and it reminds me of someone I love.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Someone stole my precious instrument, and someday I’ll get it back.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I want to be famous, whatever it takes.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I idolize a hero of the old tales and measure my deeds against that person’s.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I will do anything to prove myself superior to my hated rival.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I would do anything for the other members of my old troupe.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I’ll do anything to win fame and renown.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I’m a sucker for a pretty face.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"A scandal prevents me from ever going home again. That kind of trouble seems to follow me around.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I once satirized a noble who still wants my head. It was a mistake that I will likely repeat.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I have trouble keeping my true feelings hidden. My sharp tongue lands me in trouble.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Despite my best efforts, I am unreliable to my friends.\"}]}",
    "name": "Entertainer",
    "description": "You thrive in front of an audience, knowing how to entrance them, entertain them, and even inspire them. Your poetics can stir the hearts of those who hear you, awakening grief or joy, laughter or anger. Your music raises their spirits or captures their sorrow. Your dance steps captivate, your humor cuts to the quick. Whatever techniques you use, your art is your life.",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Acrobatics, Insight, Performance, and Sleight of Hand",
    "toolProficiencyMarkdown": "Disguise kit, one type of musical instrument",
    "languages": 0,
    "languageMarkdown": null,
    "equipmentMarkdown": "A musical instrument (one of your choice), the favor of an admirer (love letter, lock of hair, or trinket), a costume, and a belt pouch containing 150 cr",
    "specialityName": "Entertainer Routines",
    "specialityMarkdown": "A good entertainer is versatile, spicing up every performance with a variety of different routines. Choose one to three routines or roll on the table below to define your expertise as an entertainer.",
    "featureName": "By Popular Demand",
    "featureMarkdown": "You can always find a place to perform, usually in an inn or cantina but possibly with a circus, at a theater, or even in a noble’s court. At such a place, you receive free lodging and food of a modest or comfortable standard (depending on the quality of the establishment), as long as you perform each night. In addition, your performance makes you something of a local figure. When strangers recognize you in a town where you have performed, they typically take a liking to you.",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "Successful entertainers have to be able to capture and hold an audience’s attention, so they tend to have flamboyant or forceful personalities. They’re inclined toward the romantic and often cling to high-minded ideals about the practice of art and the appreciation of beauty.",
    "PartitionKey": "core",
    "RowKey": "6af34c59-9e86-4b86-8654-19b340e43ce9",
    "Timestamp": "2018-12-24T05:15:49.1497742+00:00",
    "ETag": "W/\"datetime'2018-12-24T05%3A15%3A49.1497742Z'\""
  },
  {
    "proficiencyOptions": "[\"Deception\",\"Piloting\",\"Sleight of Hand\",\"Stealth\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Silver-Tongued\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Ace Pilot\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Quick-Fingered\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Stealthy\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Entertaining Competitor\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Demolitionist\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Bypasser\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Slicer\"}]}",
    "personalityTraits": "{\"diceType\":8,\"name\":\"Personality Trait\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I am extremely sociable, especially over a mug of ale.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I always keep my wares close to me, you never know who might stumble across them otherwise.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"The best way to hide is out in the open.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I'm a terrible gossip.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Being seen with any unsavory figures is a sure way to undermine my work, which is why I work out of sight.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Deflecting questions has become second nature to me, so I rarely answer straight.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"I have dozens of identities and live in constant fear of answering to the wrong name.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"I act irrationally confident in the face of danger, nobody suspects anything when you seem like you're in charge.\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"**Morals.** I only smuggle things to improve the lives of the common folk. (Light)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"**Ruthless.** I will rise to the top of the heap by any means necessary. (Dark)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"**Friendship.** My associates are dear to me, and I want them to rise with me when I hit it big. (Lawful)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"**Dauntless.** No border crossing or bribe is too difficult- that's just the coward's way of saying exciting! (Chaotic)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"**Greater.** Good I work for a greater cause, and ply my trade only in service to it. (Any)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"**Unperturbed.** I only want to make a living for myself, and smuggling is just an edge I can use to do so. (Neutral)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"A corrupt official shut me down back in my honest days. I aim to show him a thing or two about recovery.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I never wanted to be a criminal, but it pays the bills.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"A bloodthirsty pirate stole a shipment from me and killed a dear friend of mine. I will have my vengeance.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Someone I cared about discovered my profession and has publicly denounced me, and I am caught between protecting my reputation and restoring our relationship.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"My love interest is someone who once stole from right under my nose- but they have no idea who I am or how much I admire them for their accomplishment.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"My business partners are closer to me than my family.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"\\\"Trust nobody, not even yourself.\\\" I am plagued by paranoia.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I'm so charismatic that sometimes I woo myself. Who am I, Narcissus?\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Money is my greatest motivator. I'll do almost anything given enough of it, even if I'll regret it later.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I would betray anyone to save my own skin.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I detach myself from the results of my actions in order to sleep better at night.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Someone who knows me well might call me \\\"two-faced\\\" but those who don't have no idea what hit 'em.\"}]}",
    "name": "Smuggler",
    "description": "You have spent your life hiding in the darkness, making shady deals behind closed doors. What led you to engage in a life of crime? Do you crave the thrill of lawbreaking, or did you enter the profession to pay off a debt, risking your hide on behalf of a less than honorable noble? A smuggler is an individual trained in the art of acquisition, a professional thug who can deliver anything... for a price. Smugglers tend to be more bolder criminals than most, preferring bribery or distraction over subterfuge and stealth.",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Deception, Piloting, Sleight of Hand, and Stealth",
    "toolProficiencyMarkdown": "One type of gaming set and your choice of demolitions kit, security kit, or slicer's kit",
    "languages": 0,
    "languageMarkdown": null,
    "equipmentMarkdown": "A crowbar, a set of dark common clothes including a hood, and a belt pouch containing 150 cr",
    "specialityName": null,
    "specialityMarkdown": null,
    "featureName": "Careful Selection",
    "featureMarkdown": "Some close brushes with the law have taught you that not every city guard can be bribed, and some people are simply too keen to miss minute discrepancies. This feature allows you to study a person and gain insight into whether or not they would accept a bribe, or to pick up on whether they are exceptionally more perceptive than you. It does not reveal how expensive a bribe may be for a given situation, however.",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "Smugglers might seem like villains on the surface, and many of them are nefarious to the core. But some have an abundance of endearing, if not redeeming, characteristics. There might be honor among thieves, but spies rarely show any respect for law or authority. ",
    "PartitionKey": "core",
    "RowKey": "709def4e-d30e-45d1-8dce-afaf6a625f63",
    "Timestamp": "2018-12-24T05:15:50.2135315+00:00",
    "ETag": "W/\"datetime'2018-12-24T05%3A15%3A50.2135315Z'\""
  },
  {
    "proficiencyOptions": "[\"Deception\",\"Investigation\",\"Lore\",\"Persuasion\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Silver-Tongued\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Investigator\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Loremaster\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Charming Persona\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Linguist\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Alert\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Observant\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Practiced\"}]}",
    "personalityTraits": "{\"diceType\":8,\"name\":\"Personality Trait\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I idolize a particular hero of my faction, and constantly refer to that person’s deeds and example.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I can find common ground between the fiercest enemies, empathizing with them and always working towards peace.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I see omens in every event and action.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Nothing can shake my optimistic attitude.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I quote (or misquote) sacred texts and proverbs in almost every situation.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I am tolerant (or intolerant) of other factions and respect (or condemn) them.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"I've enjoyed fine food, drink, and high society among my faction’s elite. Rough living grates on me.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"I have little practical experience dealing with people in the  world.\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"**Tradition**. The ancient traditions of worship and sacrifice must be preserved and upheld. (Lawful)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"**Charity**. I always try to help those in need, no matter what the personal cost. (Light)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"**Change**. We must help bring about the changes the gods are constantly working in the world. (Chaotic)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"**Power**. I hope to one day rise to the top of my faith’s religious hierarchy. (Lawful)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"**Faith**. I trust that my leader will guide my actions, I have faith that if I work hard, things will go well. (Lawful)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"**Aspiration**. I seek to prove myself worthy of my leader’s favor by matching my actions against his or her teachings. (Any)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I would die to recover an artifact of my faction that was lost long ago.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I will someday get revenge on the corrupt faction hierarchy who branded me a heretic.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I owe my life to the faction member who took me in when my parents died.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Everything I do is for the common people.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I will do anything to protect the faction where I served.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I seek to preserve a sacred text that my enemies consider heretical and seek to destroy.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I judge others harshly, and myself even more severely.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I put too much trust in those who wield power within my faction’s hierarchy.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"My piety sometimes leads me to blindly trust those that profess faith in my faction.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I am inflexible in my thinking.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I am suspicious of strangers and expect the worst of them.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Once I pick a goal, I become obsessed with it to the detriment of everything else in my life.\"}]}",
    "name": "Agent",
    "description": "Many organizations active in the galaxy aren't bound by strictures of geography. These factions pursue their agendas without regard for political boundaries, and their members operate anywhere the organization deems necessary. These groups employ listeners, rumormongers, smugglers, mercenaries, cache-holders (people who guard caches of wealth or items for use by the faction's operatives), haven keepers, and message drop minders, to name a few. At the core of every faction are those who don't merely fulfill a small function for that organization, but who serve as its hands, head, and heart. As a prelude to your adventuring career (and in preparation for it), you served as an agent of a particular faction. You might have operated openly or secretly, depending on the faction and its goals, as well as how those goals mesh with your own. Becoming an adventurer doesn't necessarily require you to relinquish membership in your faction (though you can choose to do so), and it might enhance your status in the faction.",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Deception, Investigation, Lore, and Persuasion",
    "toolProficiencyMarkdown": null,
    "languages": 0,
    "languageMarkdown": "Two of your choice",
    "equipmentMarkdown": "Badge or emblem of your faction, a copy of a seminal faction text (or a code-book for a covert faction), a set of common clothes, and a pouch containing 150 cr",
    "specialityName": null,
    "specialityMarkdown": null,
    "featureName": "Safe Haven",
    "featureMarkdown": "As a faction agent, you have access to a secret network of supporters and operatives who can provide assistance on your adventures. You know a set of secret signs and passwords you can use to identify such operatives, who can provide you with access to a hidden safe house, free room and board, or assistance in finding information. These agents never risk their lives for you or risk revealing their true identities.",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "Agents are shaped by their experience in their faction’s communities. Their study of the history and tenets of their faction and their relationships to it affect their mannerisms and ideals. Their flaws might be some hidden hypocrisy or heretical idea, or an ideal or bond taken to an extreme.",
    "PartitionKey": "core",
    "RowKey": "805eafa9-84e1-4d16-bf9a-ccf9516cbc35",
    "Timestamp": "2018-12-24T05:15:48.7034575+00:00",
    "ETag": "W/\"datetime'2018-12-24T05%3A15%3A48.7034575Z'\""
  },
  {
    "proficiencyOptions": "[\"Investigation\",\"Insight\",\"Lore\",\"Nature\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Empathic\"},{\"minValue\":1,\"maxValue\":1,\"result\":\"Loremaster\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Investigator\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Naturalist\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Linguist\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Keen Mind\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Observant\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Healer\"}]}",
    "personalityTraits": "{\"diceType\":8,\"name\":\"Personality Trait\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I use polysyllabic words that convey the impression of great erudition.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I've read every book in the world’s greatest libraries—or I like to boast that I have.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I'm used to helping out those who aren’t as smart as I am, and I patiently explain anything and everything to others.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"There’s nothing I like more than a good mystery.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I’m willing to listen to every side of an argument before I make my own judgment.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I... speak... slowly... when talking... to idiots,... which... almost... everyone... is... compared... to me.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"I am horribly, horribly awkward in social situations.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"I’m convinced that people are always trying to steal my secrets.\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"**Knowledge**. The path to power and self-improvement is through knowledge. (Neutral)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"**Beauty**. What is beautiful points us beyond itself toward what is true. (Light)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"**Logic**. Emotions must not cloud our logical thinking. (Lawful)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"**No Limits**. Nothing should fetter the infinite possibility inherent in all existence. (Chaotic)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"**Power**. Knowledge is the path to power and domination. (Dark)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"**Self-Improvement**. The goal of a life of study is the betterment of oneself. (Any)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"It is my duty to protect my students.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I have an ancient text that holds terrible secrets that must not fall into the wrong hands.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I work to preserve a library, university, scriptorium, or monastery.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"My life’s work is a series of tomes related to a specific field of lore.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I've been searching my whole life for the answer to a certain question.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I sold my soul for knowledge. I hope to do great deeds and win it back.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I am easily distracted by the promise of information.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Most people scream and run when they see a monster. I stop and take notes on its anatomy.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Unlocking an ancient mystery is worth the price of a civilization.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I overlook obvious solutions in favor of complicated ones.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I speak without really thinking through my words, invariably insulting others.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I can’t keep a secret to save my life, or anyone else’s.\"}]}",
    "name": "Student",
    "description": "As a child, you were inquisitive when your playmates were possessive or raucous. In your formative years, you found your way to one of the galaxy's great institutes of learning, where you were apprenticed and taught that knowledge is a more valuable treasure than gold or gems. Now you are ready to leave your home- not to abandon it, but to quest for new lore to add to its storehouse of knowledge.\\n\\nThe most well-known of the galaxy's fonts of knowledge is the Library of the Republic. The great library is always in need of workers and attendants, some of whom rise through the ranks to assume roles of greater responsibility and prominence. You might be one of Coruscant's own, dedicated to the curatorship of what is likely the most complete body of lore and history in all the world.",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Insight, Lore, Investigation, and Nature",
    "toolProficiencyMarkdown": null,
    "languages": 0,
    "languageMarkdown": "Two of your choice",
    "equipmentMarkdown": "The scholar's robes of your cloister, a writing kit (small pouch with a quill, ink, folded parchment, and a small penknife), a borrowed book on the subject of your current study, and a pouch containing 100 cr",
    "specialityName": null,
    "specialityMarkdown": null,
    "featureName": "Library Access",
    "featureMarkdown": "Though others must often endure extensive interviews and significant fees to gain access to even the most common archives in your library, you have free and easy access to the majority of the library, though it might also have repositories of lore that are too valuable, powerful, or secret to permit anyone immediate access.\\n\\nYou have a working knowledge of your cloister's personnel and bureaucracy, and you know how to navigate those connections with some ease.\\n\\nAdditionally, you are likely to gain preferential treatment at other libraries across the galaxy, as professional courtesy shown to a fellow scholar.",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "Cloistered scholars are defined by their extensive studies, and their characteristics reflect this life of study. Devoted to scholarly pursuits, they value knowledge highly – as a worthy goal in itself, or as a means to a desirable end.",
    "PartitionKey": "core",
    "RowKey": "8157ccf6-5d94-4f8b-b136-b352e1f32409",
    "Timestamp": "2018-12-27T21:18:02.7685036+00:00",
    "ETag": "W/\"datetime'2018-12-27T21%3A18%3A02.7685036Z'\""
  },
  {
    "proficiencyOptions": "[\"Athletics\",\"Intimidation\",\"Piloting\",\"Survival\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "{\"diceType\":8,\"name\":\"Clan\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Vizsla\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Fett\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Kryze\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Ordo\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Wren\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Lok\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Cadera\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Clanless\"}]}",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\" Athlete \"},{\"minValue\":2,\"maxValue\":2,\"result\":\" Threatening \"},{\"minValue\":3,\"maxValue\":3,\"result\":\" Ace Pilot\"},{\"minValue\":4,\"maxValue\":4,\"result\":\" Survivalist \"},{\"minValue\":5,\"maxValue\":5,\"result\":\" Durable \"},{\"minValue\":6,\"maxValue\":6,\"result\":\" Weapon Expert \"},{\"minValue\":7,\"maxValue\":7,\"result\":\" Brawny \"},{\"minValue\":8,\"maxValue\":8,\"result\":\" Fanatic \"}]}",
    "personalityTraits": "{\"diceType\":8,\"name\":\"Personality Trait\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\" I try and bring my culture to outsiders.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\" I always put my clan first.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\" I follow the Resol'nare to the letter.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\" I love a good spar.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\" I enjoy traveling the galaxy.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\" I keep a small trophy on me to remind me of a past victory.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\" I view the force as dishonorable in combat.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\" I've seen the horrors of battle and try to prevent it.\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\" **Tradition** I live by my clan's ways, and will continue to do so. (Lawful)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\" **Power** I strive to be the best warrior, no matter who stands in my way. (Dark)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\" **Respect** I have earned the respect of many, and I intend to keep it. (Light)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\" **Freedom** I enjoy having the ability to do whatever I want. (Chaotic)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\" **Comradery** I'll put everything on the line for those dear to me. (Any)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\" **Aspiration** I'll succeed in my goals, it just takes time and effort. (Any)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\" I lost someone dear to me in battle, I will always honor them.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\" Honor is everything to me.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\" I will lay down my life for those beside me.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\" I must keep the traditions of my ancestors alive.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\" No matter where I go, Mandalore is my home.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\" In death, I will find glory.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\" I look down on outsiders.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\" I have no respect for anyone who flees. Cowardice is unacceptable.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\" I don't see much use in talking, a blaster is all I need to make my point.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\" I stick to my traditions no matter what, even at the cost of others.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\" I retreated once, and I've regretted it ever since.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\" I value a victory regardless of the ethics behind the victory.\"}]}",
    "name": "Mandalorian",
    "description": "You are a child of Mandalore. As a member of the most renowned warrior culture in history, your people are known for being strong and hardy. Mandalorian culture is built around the honor and glory that come from victory in battle.",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Athletics, Intimidation, Piloting, and Survival",
    "toolProficiencyMarkdown": null,
    "languages": 0,
    "languageMarkdown": "Mando'a and one of your choice",
    "equipmentMarkdown": "A set of traveler's clothes, a trophy from a previous victory, and a pouch containing 200 cr",
    "specialityName": "Mandalorian Clan",
    "specialityMarkdown": "Mandalorian culture is built on the backbone of various clans. The clan you are a part of has it's own history, allegiances, and fueds which shape your persepctive. Choose an option or roll on the table below to determine your clan.",
    "featureName": "Child of Mandalore",
    "featureMarkdown": "Other Mandalorians know, and will look out for you. If you're ever in need of a place to stay, or a meal to eat, other Mandalorians  will help you as long as your clans aren't feuding. This could be in the form of shelters, meals, even healing. If the Mandalorians are of your clan or a clan friendly to you, they may be willing to help you even at cost to themselves.",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "Mandalorians are a meritocracy where birthplace, rank, status, and citizenship mean nothing. You are what you do. Mandalorians live by the Resol'nare (the \"Six Actions\"). As a true Mandalorian you should strive to live by this code as much as possible by remaining honorable. Your flaw(s) might consist of any dishonor you've committed, or even being too honorable.",
    "PartitionKey": "core",
    "RowKey": "8546853a-cc27-40e7-ac4e-619b6eea820c",
    "Timestamp": "2018-12-24T05:15:49.4970217+00:00",
    "ETag": "W/\"datetime'2018-12-24T05%3A15%3A49.4970217Z'\""
  },
  {
    "proficiencyOptions": "[\"Deception\",\"Insight\",\"Intimidation\",\"Sleight of Hand\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Silver-Tongued\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Empathic\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Threatening\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Quick-Fingered\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Entertaining Competitor\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Keen Mind\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Observant\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Practiced\"}]}",
    "personalityTraits": "{\"diceType\":8,\"name\":\"Personality Trait\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I like to impress everyone I meet with a simple trick or a quick joke.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I constantly make side bets on everything that happens around me.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"No matter how high the stakes, I always appear calm.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I try to be unpredictable, so no one will know when I'm bluffing.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I never back down from a challenge.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I can't get satisfaction out of something if the stakes are too low.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"I tend to make friends out of enemies, and enemies out of friends.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"I prefer one game above all others.\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"**Risk**. Nothing worth doing is ever a sure thing. (Chaotic)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"**Victory**. Never make a bet unless you're sure you can win. (Lawful)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"**Gred**. Anything that isn't mine soon will be. (Dark)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"**Charity**. I share my winnings with the less fortunate. (Light)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"**Surprise**. Life is a game worth playing, because you never know how the dice will land. (Any)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"**Laziness**. Working is for chumps. (Any)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I owe a lot of money to the wrong kind of people.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I still keep the first coin I ever won. It's my good luck charm.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Most of my winnings go to my home.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Someday I will own my own casino.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I lost a large sum of money to a con artist; I seek to get it back.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I hide my gambling behind a normal life. My friends have no idea who I really am.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I can't step away from the table when I'm losing.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I spend money faster than I can make it.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Everyone has a price. Mine happens to be pretty low.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I assume everyone is hiding something from me.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I tend to value money more than people.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I like to think I could drink anyone under the table, but I'm really a lightweight.\"}]}",
    "name": "Gambler",
    "description": "You are a skilled gambler who spends most of your time in casinos, bar rooms, and gambling dens. Are your activities legal, or do you break the law? Have you ever cheated in a game, or do you play by the rules? No matter what, your life has been one of excitement, chance, and danger.",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Deception, Insight, Intimidation, and Sleight of Hand",
    "toolProficiencyMarkdown": "Two types of gaming sets",
    "languages": 0,
    "languageMarkdown": null,
    "equipmentMarkdown": "A set of common clothes, a set of dice, a deck of playing cards, a lucky charm, and a belt pouch containing 100 cr.",
    "specialityName": null,
    "specialityMarkdown": null,
    "featureName": "Let's Make It Interesting",
    "featureMarkdown": "You can convince nearly anyone to put up something they aren't normally willing to part with (property or information) in a game of chance. Your DM might rule that they will only agree to a game of their choosing, and they may only agree if they feel the odds are in their favor.",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "Gambling is your passion, for better or for worse. Most gamblers see their vices as virtues, and overlook things in their pursuit of the rush.",
    "PartitionKey": "core",
    "RowKey": "8ab1dc73-fe95-4c90-af9a-baa2efc250e3",
    "Timestamp": "2018-12-24T05:15:49.2658572+00:00",
    "ETag": "W/\"datetime'2018-12-24T05%3A15%3A49.2658572Z'\""
  },
  {
    "proficiencyOptions": "[\"Insight\",\"Lore\",\"Persuasion\",\"Performance\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Empathic\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Loremaster\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Performer\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Charming Persona\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Linguist\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Crafter\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Gourmand\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Keen Mind\"}]}",
    "personalityTraits": "{\"diceType\":8,\"name\":\"Personality Trait\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I am compulsively neat, and clean; I feel uncomfortable if my companions and I are ever dirty or  unpresentable.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I am a bit of a snob, and look down on the common rabble.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I am extremely subservient; I rarely raise my voice or object.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I may be quite calm and polite around those of higher power than I; but I'm harsh towards all my underlings, flexing the little power I have.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I dote over my companions like a concerned mother bird, fixing their clothing and making sure they look nice.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I hated my time as a servant, and go out of my way to enjoy myself and let loose, rarely holding my tongue.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"I rarely show any emotions, remaining calm and stoic even in the worst of situations.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"I can-or think I can-diffuse the most tense and stressful of situations with the right word or phrase.\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"**Service.** Your wish is my desire. (Lawful)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"**Helpful.** I just enjoy making myself useful. (Light)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"**Free.** Noone should be bound to the chains of servitude. (Chaotic)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"**Infiltrate.** From the position of a servant, I can worm my way into places of power! (Dark)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"**Payment.** I don't care what my masters do; as long as I get paid. (Neutral)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"**Live.** I only wish to serve in peace. (Any)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I am still loyal to my old master.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"The Lord I worked for is after my head, and will do anything to capture me.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"My family still live as servants; I hope to earn a better life for them.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"An older servant taught me the ropes and looked out for me; and I owe them a great debt.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I will exact revenge on the bastards who ruined (or ended) my Master's life.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I have plenty of friends in high places; and they've come in useful from time to time.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I become incredibly nervous around people of power and importance.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Saying that I'm a little bossy is a bit of an understatement.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I can be a sycophant, constantly fawning and flattering others; which can come off as shallow.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I've lived a relatively pampered life; the world of commoners is dull and painful to me.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I never speak for myself, letting others walk all over me.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I often can seem stiff, old fashioned and generally a stick in the mud.\"}]}",
    "name": "Servant",
    "description": "You have lived much of your life in the service of a lord, noble, merchant, or someone else with much wealth or power. You fetched their coats, drove their chariots, pressed their clothes; and generally did what they asked you to do.\\n\\nWere you a highly respected butler? A simple scullery maid? Were you born into service, or did you join later? Were you close to your master or masters, or were they distant and cold? Did they treat you well, or beat you at the drop of a hat?",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Insight, Lore, Performance, and Persuasion",
    "toolProficiencyMarkdown": "One of your choice",
    "languages": 0,
    "languageMarkdown": "One of your choice",
    "equipmentMarkdown": "A noble symbol representing your employer, a set of artisan's tools (one of your choice), a set of nice clothes, a set of common clothes, and a belt pouch containing 100 cr",
    "specialityName": null,
    "specialityMarkdown": null,
    "featureName": "Decorum",
    "featureMarkdown": "You know how to carry yourself around the elite and their servants. When in the presence of someone of power, or the servants of such a person, you can easily act as if you belong and, barring any extremely outlandish behavior, you can pass off your companions as belonging, too.",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "A servant, for better or worse, will have their personality affected by their years of servitude. ",
    "PartitionKey": "core",
    "RowKey": "94bce762-c560-49ae-9e0e-f78416eb9c48",
    "Timestamp": "2018-12-27T21:18:02.614395+00:00",
    "ETag": "W/\"datetime'2018-12-27T21%3A18%3A02.614395Z'\""
  },
  {
    "proficiencyOptions": "[\"Deception\",\"Insight\",\"Intimidation\",\"Lore\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Silver-Tongued\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Empathic\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Threatening\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Loremaster\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Linguist\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Crafter\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Force of Personality\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Force Sensitive\"}]}",
    "personalityTraits": "{\"diceType\":8,\"name\":\"Personality Trait\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I idolize a particular Sith, and constantly refer to that person’s deeds and example.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I can find common ground between the fiercest enemies, empathizing with them and always working towards peace.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I see omens in every event and action. The Force tries to speak to us, we just need to listen\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Nothing can shake my optimistic attitude.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I quote (or misquote) sacred Sith texts and proverbs in almost every situation.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I am tolerant (or intolerant) of those who don't support the Sith.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"I've enjoyed fine food, drink, and high society. Rough living grates on me.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"I’ve spent so long in the Sith temple that I have little practical experience dealing with people in the  world.\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"**Tradition**. The ancient traditions of worship and sacrifice must be preserved and upheld. (Any)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"**Disdain**. I never try to help those in need, regardless of how simple it would be. (Dark)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"**Change**. We must help bring about the changes the Force is constantly working in the world. (Any)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"**Power**. I hope to one day rise to the rank of Dark Lord of the Sith. (Any)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"**Faith**. I trust that the Force will guide my actions; I have faith that if I work hard, things will go well. (Any)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"**Aspiration**. I seek to prove myself worthy of the Force by matching my actions against the Sith teachings. (Any)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I would die to recover an ancient Sith relic that was lost long ago.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I will someday get revenge on those who razed my temple.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I owe my life to the Sith who took me in when my parents died.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Everything I do is for the common people.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I will do anything to protect the temple where I served.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I seek to preserve a sacred text that my enemies seek to destroy.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I judge others harshly, and myself even more severely.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I put too much trust in those who wield power within my temple’s hierarchy.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"My piety sometimes leads me to blindly trust those that profess faith in the Force.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I am inflexible in my thinking.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I am suspicious of strangers and expect the worst of them.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Once I pick a goal, I become obsessed with it to the detriment of everything else in my life.\"}]}",
    "name": "Sith",
    "description": "You are an acolyte of the Sith Order: an ancient order of Force-wielders devoted to the dark side of the Force. Emerging as a divergent faction to the Jedi Order, the Sith are mortal enemies of the Jedi and fight against them. Driven by emotions such as hate, anger, and greed, the Sith are deceptive and ultimately obsessed with amassing power no matter the cost. You follow the Sith Code:\\n\\n*\"Peace is a lie. There is only passion.*\\n*Through passion I gain strength.*\\n*Through strength I gain power.*\\n*Through power I gain victory.*\\n*Through victory my chains are broken.*\\n*The Force shall free me.\"*",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Deception, Insight, Intimidation, and Lore",
    "toolProficiencyMarkdown": "Artificer's tools",
    "languages": 0,
    "languageMarkdown": "One of your choice",
    "equipmentMarkdown": "A copy of the Sith code, a set of common clothes including a robe, and a belt pouch containing 150 cr",
    "specialityName": null,
    "specialityMarkdown": null,
    "featureName": "Asylum by the Fearful",
    "featureMarkdown": "As a Sith, you instill fear in those who are aware of your standing. You and your adventuring companions can expect to receive free healing and care at any Sith temple, and those who are aware of your nature will support you (but only you) at a modest lifestyle.\\n\\nYou might also have ties to a specific Sith temple and have a residence there. This could be the temple where you trained, or a temple where you have found a new home. While near your temple, you can call upon the Sith for assistance, provided the assistance you ask for benefits them and you remain in good standing with your temple.",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "Sith are shaped by their training. They study the Sith code and use it to oppress the weak and quell resistance. Their study of the Sith code affects their mannerisms and ideals. Their flaws might be some hidden hypocrisy or heretical idea, or an ideal or bond taken to an extreme.",
    "PartitionKey": "core",
    "RowKey": "a5e1c706-06c5-4a4c-af6e-02ac92b305f1",
    "Timestamp": "2018-12-24T05:15:50.0894428+00:00",
    "ETag": "W/\"datetime'2018-12-24T05%3A15%3A50.0894428Z'\""
  },
  {
    "proficiencyOptions": "[\"Deception\",\"Insight\",\"Persuasion\",\"Stealth\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Silver-Tongued\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Empathic\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Charming Persona\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Stealthy\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Demolitionist\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Bypasser\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Slicer\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Linguist\"}]}",
    "personalityTraits": "{\"diceType\":8,\"name\":\"Personality Trait\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I always have a plan for what to do when things go wrong.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I am always calm, no matter what the situation. I never raise my voice or let my emotions control me.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"The first thing I do in a new place is note the locations of everything valuable – or where such things could be hidden.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I would rather make a new friend than a new enemy.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I am incredibly slow to trust. Those who seem the fairest often have the most to hide.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I don’t pay attention to the risks in a situation. Never tell me the odds.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"The best way to get me to do something is to tell me I can’t do it.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"I blow up at the slightest insult.\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"**Honor**. I don’t steal from others in the trade. (Lawful)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"**Freedom**. Chains are meant to be broken, as are those who would forge them. (Chaotic)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"**Charity**. I steal from the wealthy so that I can help people in need. (Light)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"**Greed**. I will do whatever it takes to become wealthy. (Dark)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"**People**. I’m loyal to my friends, not to any ideals, and everyone else can take a trip down the Styx for all I care. (Neutral)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"**Redemption**. There’s a spark of good in everyone. (Light)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I’m trying to pay off an old debt I owe to a generous benefactor.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"My ill-gotten gains go to support my family.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Something important was taken from me, and I aim to steal it back.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I will become the greatest thief that ever lived.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I’m guilty of a terrible crime. I hope I can redeem myself for it.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Someone I loved died because of a mistake I made. That will never happen again.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"When I see something valuable, I can’t think about anything but how to steal it.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"When faced with a choice between money and my friends, I usually choose the money.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"If there’s a plan, I’ll forget it. If I don’t forget it, I’ll ignore it.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I have a “tell” that reveals when I'm lying.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I turn tail and run when things look bad.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"An innocent person is in prison for a crime that I committed. I’m okay with that.\"}]}",
    "name": "Bounty Hunter",
    "description": "Before you became an adventurer, your life was already full of conflict and excitement, because you made a living tracking down people for pay. Unlike some people who collect bounties, though, you aren't a savage who follows quarry into or through the wilderness. You’re involved in a lucrative trade, in the place where you live, that routinely tests your skills and survival instincts. What's more, you aren't alone, as a bounty hunter in the wild would be: you routinely interact with both the criminal subculture and other bounty hunters, maintaining contacts in both areas to help you succeed.\\n\\nYou might be a cunning thief-catcher, prowling the rooftops to catch one of the myriad burglars of the city. Perhaps you are someone who has your ear to the street, aware of the doings of street gangs. You might be a \"velvet mask\" bounty hunter, one who blends in with high society and noble circles in order to catch the criminals that prey on the rich, whether pickpockets or con artists. As a member of an adventuring party, you might find it more difficult to pursue a personal agenda that doesn't fit with the group's objectives - but on the other hand, you can take down much more formidable targets with the help of your companions.",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Deception, Insight, Persuasion, and Stealth",
    "toolProficiencyMarkdown": "Your choice of demolitions kit, security kit, or slicer's kit",
    "languages": 0,
    "languageMarkdown": "One of your choice",
    "equipmentMarkdown": "A set of clothes appropriate to your duties, a set of binders, and a pouch containing 200 cr",
    "specialityName": null,
    "specialityMarkdown": null,
    "featureName": "Ear to the Ground",
    "featureMarkdown": "You are in frequent contact with people in the segment of society that your chosen quarries move through. These people might be associated with the criminal underworld, the rough-and-tumble folk of the streets, or members of high society. This connection comes in the form of a contact in any city you visit, a person who provides information about the people and places of the local area.",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "Your bond might involve other bounty hunters or the organizations or individuals that employ you. Your ideal could be associated with your determination always to catch your quarry or your desire to maintain your reputation for being dependable.",
    "PartitionKey": "core",
    "RowKey": "a8d7266c-137d-466c-8415-f1b52f18cb9f",
    "Timestamp": "2018-12-24T05:15:48.8675734+00:00",
    "ETag": "W/\"datetime'2018-12-24T05%3A15%3A48.8675734Z'\""
  },
  {
    "proficiencyOptions": "[\"Deception\",\"Insight\",\"Persuasion\",\"Performance\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Silver-Tongued\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Empathic\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Performer\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Charming Persona\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Linguist\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Inspiring Leader\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Gourmand\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Practiced\"}]}",
    "personalityTraits": "{\"diceType\":8,\"name\":\"Personality Trait\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I believe that anything worth doing is worth doing right. I can’t help it— I’m a perfectionist.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I’m a snob who looks down on those who can’t appreciate fine art.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I always want to know how things work and what makes people tick.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I’m full of witty aphorisms and have a proverb for every occasion.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I’m rude to people who lack my commitment to hard work and fair play.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I like to talk at length about my profession.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"I don’t part with my money easily and will haggle tirelessly to get the best deal possible.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"I believe I’m well known for my work, and I'm always taken aback when people haven’t heard of me.\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"**Community.** It is the duty of all civilized people to strengthen the bonds of community and the security of civilization. (Lawful)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"**Generosity.** My talents were given to me so that I could use them to benefit the world. (Light)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"**Freedom.** Everyone should be free to pursue his or her own livelihood. (Chaotic)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"**Greed.** I’m only in it for the money. (Dark)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"**People.** I’m committed to the people I care about, not to ideals. (Neutral)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"**Aspiration.** I work hard to be the best there is at my craft. (Any)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"The workshop where I learned my trade is the most important place in the world to me.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I commissioned a great work for someone unworthy of it; I now search for someone worthy.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I owe my guild a great debt for forging me into the person I am today.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I pursue wealth to secure someone’s love.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"One day I will return to my guild and prove that I am the greatest artisan of them all.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I will get revenge on the Dark forces that destroyed my place of business and ruined my livelihood.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I’ll do anything to get my hands on something rare or priceless.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I’m quick to assume that someone is trying to cheat me.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"No one must ever learn that I once stole money from guild coffers.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I’m never satisfied with what I have— I always want more.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I would kill to acquire a noble title.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I’m horribly jealous of anyone who can outshine my handiwork. Everywhere I go, I’m surrounded by rivals.\"}]}",
    "name": "Guild Merchant",
    "description": "Instead of an artisans’ guild, you might belong to a guild of traders, caravan masters, or shopkeepers. You don’t craft items yourself but earn a living by buying and selling the works of others. Your guild might be a large merchant consortium (or family) with interests across the galaxy. Perhaps you transported goods from one place to another, by ship, wagon, or caravan, or bought them from traveling traders and sold them in your own little shop. In some ways, the traveling merchant’s life lends itself to adventure far more than the life of an artisan.",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Deception, Insight, Performance, and Persuasion",
    "toolProficiencyMarkdown": null,
    "languages": 0,
    "languageMarkdown": "Two of your choice",
    "equipmentMarkdown": "A letter of introduction from your guild, a set of traveler’s clothes, and a belt pouch containing 150 cr",
    "specialityName": null,
    "specialityMarkdown": null,
    "featureName": "Guild Membership",
    "featureMarkdown": "As an established and respected member of a guild, you can rely on certain benefits that membership provides. Your fellow guild members will provide you with lodging and food if necessary, and pay for your funeral if needed. In some cities and towns, a guildhall offers a central place to meet other members of your profession, which can be a good place to meet potential patrons, allies, or hirelings.\\n\\nGuilds often wield tremendous political power. If you are accused of a crime, your guild will support you if a good case can be made for your innocence or the crime is justifiable. You can also gain access to powerful political figures through the guild, if you are a member in good standing. You must pay dues of 50 cr per month to the guild. Your dues must be current to remain in the guild’s good graces.",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "Guild merchants are among the most ordinary people in the world—until they abscond to take up an adventuring career. They understand the value of hard work and the importance of community, but they’re vulnerable to sins of greed and covetousness.",
    "PartitionKey": "core",
    "RowKey": "af8e6845-b045-4315-98bb-01cf738e2e20",
    "Timestamp": "2018-12-27T21:18:01.7187647+00:00",
    "ETag": "W/\"datetime'2018-12-27T21%3A18%3A01.7187647Z'\""
  },
  {
    "proficiencyOptions": "[\"Deception\",\"Intimidation\",\"Sleight of Hand\",\"Stealth\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "{\"diceType\":8,\"name\":\"Specialty\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Blackmailer\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Burglar\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Enforcer\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Fence\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Highway robber\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Hired killer\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Pickpocket\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Thug\"}]}",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Silver-Tongued\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Ace Pilot\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Quick-Fingered\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Stealthy\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Entertaining Competitor\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Demolitionist\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Bypasser\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Slicer\"}]}",
    "personalityTraits": "{\"diceType\":8,\"name\":\"Personality Trait\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I always have a plan for what to do when things go wrong.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I am always calm, no matter what the situation. I never raise my voice or let me emotions control me.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"The first thing I do in a new place is note the locations of everything valuable – or where such things could be hidden.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I would rather make a new friend than a new enemy.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I am incredibly slow to trust. Those who seem the fairest often have the most to hide.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I don’t pay attention to the risks in a situation. Never tell me the odds.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"The best way to get me to do something is to tell me I can’t do it.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"I blow up at the slightest insult.\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"**Honor**. I don’t steal from others in the trade. (Lawful)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"**Freedom**. Chains are meant to be broken, as are those who would forge them. (Chaotic)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"**Charity**. I steal from the wealthy so that I can help people in need. (Light)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"**Greed**. I will do whatever it takes to become wealthy. (Dark)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"**People**. I’m loyal to my friends, not to any ideals, and everyone else can take a trip down the Styx for all I care. (Neutral)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"**Redemption**. There’s a spark of good in everyone. (Light)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I’m trying to pay off an old debt I owe to a generous benefactor.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"My ill-gotten gains go to support my family.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Something important was taken from me, and I aim to steal it back.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I will become the greatest thief that ever lived.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I’m guilty of a terrible crime. I hope I can redeem myself for it.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Someone I loved died because of a mistake I made. That will never happen again.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"When I see something valuable, I can’t think about anything but how to steal it.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"When faced with a choice between money and my friends, I usually choose the money.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"If there’s a plan, I’ll forget it. If I don’t forget it, I’ll ignore it.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I have a “tell” that reveals when I'm lying.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I turn tail and run when things look bad.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"An innocent person is in prison for a crime that I committed. I’m okay with that.\"}]}",
    "name": "Criminal",
    "description": "You are an experienced criminal with a history of breaking the law. You have spent a lot of time among other criminals and still have contacts within the criminal underworld. You’re far closer than most people to the world of murder, theft, and violence that pervades the underbelly of civilization, and you have survived up to this point by flouting the rules and regulations of society.",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Deception, Intimidation, Sleight of Hand, and Stealth",
    "toolProficiencyMarkdown": "One type of gaming set, your choice of demolitions kit, security kit, or slicer's kit",
    "languages": 0,
    "languageMarkdown": null,
    "equipmentMarkdown": "A set of common clothes with a hood, a gaming set (one of your choice), and a belt pouch containing 150 cr",
    "specialityName": "Criminal Specialty",
    "specialityMarkdown": "Individual criminals often have particular specialties, whether a part of an organization or a solo endeavor. Choose the role you played in your criminal life, or roll on the table below.",
    "featureName": "Criminal Contact",
    "featureMarkdown": "You have a reliable and trustworthy contact who acts as your liaison to a network of other criminals. You know how to get messages to and from your contact, even over great distances; specifically, you know the local messengers, corrupt caravan masters, and seedy sailors who can deliver messages for you.",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "Criminals might seem like villains on the surface, and many of them are villainous to the core. But some have an abundance of endearing, if not redeeming, characteristics. There might be honor among thieves, but criminals rarely show any respect for law or authority. ",
    "PartitionKey": "core",
    "RowKey": "b417953a-4b21-4a68-85ba-4fa57f704968",
    "Timestamp": "2018-12-24T05:15:49.021683+00:00",
    "ETag": "W/\"datetime'2018-12-24T05%3A15%3A49.021683Z'\""
  },
  {
    "proficiencyOptions": "[\"Deception\",\"Insight\",\"Performance\",\"Survival\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Silver-Tongued\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Empathic\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Performer\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Survivalist\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Linguist\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Actor\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Practiced\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Gourmand\"}]}",
    "personalityTraits": "{\"diceType\":8,\"name\":\"Personality Trait\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I believe that anything worth doing is worth doing right. I can’t help it— I’m a perfectionist.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I’m a snob who looks down on those who can’t appreciate fine art.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I always want to know how things work and what makes people tick.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I’m full of witty aphorisms and have a proverb for every occasion.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I’m rude to people who lack my commitment to hard work and fair play.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I like to talk at length about my profession.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"I don’t part with my money easily and will haggle tirelessly to get the best deal possible.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"I’m well known for my work, so I'm always taken aback when people haven’t heard of me.\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"**Community.** It is the duty of all civilized people to strengthen the bonds of community and the security of civilization. (Lawful)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"**Generosity.** My talents were given to me so that I could use them to benefit the world. (Light)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"**Freedom.** Everyone should be free to pursue his or her own livelihood. (Chaotic)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"**Greed.** I’m only in it for the money. (Dark)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"**People.** I’m committed to the people I care about, not to ideals. (Neutral)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"**Aspiration.** I work hard to be the best there is at my craft. (Any)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"The location where I learned my trade is the most important place in the world to me.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I created a great work for someone unworthy to receive it. I’m still looking for someone worthy.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I owe someone a great debt for forging me into the person I am today.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I pursue wealth to secure someone’s love.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"One day I will return to my guild and prove that I am the greatest artisan of them all.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I will get revenge on the Dark forces that destroyed my place of business and ruined my livelihood.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I’ll do anything to get my hands on something rare or priceless.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I’m quick to assume that someone is trying to cheat me.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"No one must ever learn that I once stole money from guild coffers.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I’m never satisfied with what I have— I always want more.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I would kill to acquire a noble title.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I’m horribly jealous of anyone who can outshine my handiwork. Everywhere I go, I’m surrounded by rivals.\"}]}",
    "name": "Courtier",
    "description": "In your earlier days, you were a personage of some significance in a noble court or a bureaucratic organization. You might or might not come from an upper-class family; your talents, rather than the circumstances of your birth, could have secured you this position.\\n\\nYou might have been one of the many functionaries, attendants, and other hangers-on in Coruscant's upper echelons, or perhaps you traveled in Nar Shaddaa's baroque and sometimes cutthroat conglomeration of guilds, nobles, adventurers, and secret societies. You might have been one of the behind-the-scenes law-keepers or functionaries on Dromund Kaas, or you might have grown up on some other affluent planet.\\n\\nEven if you are no longer a full-fledged member of the group that gave you your start in life, your relationships with your former fellows can be an advantage for you and your adventuring comrades. You might undertake missions with your new companions that further the interest of the organization that gave you your start in life. In any event, the abilities that you honed while serving as a courtier will stand you in good stead as an adventurer.",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Deception, Insight, Performance, and Survival",
    "toolProficiencyMarkdown": null,
    "languages": 0,
    "languageMarkdown": "Two of your choice",
    "equipmentMarkdown": "A set of fine clothes and a pouch containing 150 cr",
    "specialityName": null,
    "specialityMarkdown": null,
    "featureName": "Court Functionality",
    "featureMarkdown": "Your knowledge of how bureaucracies function lets you gain access to the records and inner workings of any noble court or government you encounter. You know who the movers and shakers are, whom to go to for the favors you seek, and what the current intrigues of interest in the group are.",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "The noble court or bureaucratic organization where you got your start is directly or indirectly associated with your bond (which could pertain to certain individuals in the group, such as your sponsor or mentor). Your ideal might be concerned with the prevailing philosophy of your court or organization.",
    "PartitionKey": "core",
    "RowKey": "b633da3a-dd01-4d7b-930a-99f9f725e4fb",
    "Timestamp": "2018-12-27T21:18:00.6340003+00:00",
    "ETag": "W/\"datetime'2018-12-27T21%3A18%3A00.6340003Z'\""
  },
  {
    "proficiencyOptions": "[\"Deception\",\"Insight\",\"Sleight of Hand\",\"Stealth\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Silver-Tongued\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Empathic\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Quick-Fingered\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Stealthy\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Master of Disguise\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Bypasser\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Alert\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Athlete\"}]}",
    "personalityTraits": "{\"diceType\":8,\"name\":\"Personality Trait\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I hide scraps of food and trinkets away in my pockets.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I ask a lot of questions.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I like to squeeze into small places where no one else can get to me.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I sleep with my back to a wall or tree, with everything I own wrapped in a bundle in my arms.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I eat like a pig and have bad manners.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I think anyone who’s nice to me is hiding Dark intent.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"I don’t like to bathe.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"I bluntly say what other people are hinting at or hiding.\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"**Respect**. All people, rich or poor, deserve respect. (Light)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"**Community**. We have to take care of each other, because no one else is going to do it. (Lawful)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"**Change**. The low are lifted up, and the high and mighty are brought down. Change is the nature of things. (Chaotic)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"**Retribution**. The rich need to be shown what life and death are like in the gutters. (Dark)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"**People**. I help the people who help me—that’s what keeps us alive. (Neutral)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"**Aspiration**. I'm going to prove that I'm worthy of a better life. (Any)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"My town or city is my home, and I’ll fight to defend it.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I sponsor an orphanage to keep others from enduring what I was forced to endure.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I owe my survival to another urchin who taught me to live on the streets.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I owe a debt I can never repay to the person who took pity on me.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I escaped my life of poverty by robbing an important person, and I’m wanted for it.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"No one else should have to endure the hardships I’ve been through.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"If I'm outnumbered, I will run away from a fight.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Gold seems like a lot of money to me, and I’ll do just about anything for more of it.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I will never fully trust anyone other than myself.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I’d rather kill someone in their sleep then fight fair.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"It’s not stealing if I need it more than someone else.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"People who can't take care of themselves get what they deserve.\"}]}",
    "name": "Urchin",
    "description": "You grew up on the streets alone, orphaned, and poor. You had no one to watch over you or to provide for you, so you learned to provide for yourself. You fought fiercely over food and kept a constant watch out for other desperate souls who might steal from you. You slept on rooftops and in alleyways, exposed to the elements, and endured sickness without the advantage of medicine or a place to recuperate. You’ve survived despite all odds, and did so through cunning, strength, speed, or some combination of each.\\n\\nYou begin your adventuring career with enough money to live modestly but securely for at least ten days. How did you come by that money? What allowed you to break free of your desperate circumstances and embark on a better life?",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Deception, Insight, Sleight of Hand, and Stealth",
    "toolProficiencyMarkdown": "Disguise kit, security kit",
    "languages": 0,
    "languageMarkdown": null,
    "equipmentMarkdown": "A small knife, a map of the city you grew up in, a pet mouse, a token to remember your parents by, a set of common clothes, and a belt pouch containing 100 cr",
    "specialityName": null,
    "specialityMarkdown": null,
    "featureName": "City of Secrets",
    "featureMarkdown": "You know the secret patterns and flows to cities and can find passages through the urban sprawl that others would miss. When you are not in combat, you (and companions you lead) can travel between any two locations in the city twice as fast as your speed would normally allow.",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "Urchins are shaped by lives of desperate poverty, for good and for ill. They tend to be driven either by a commitment to the people with whom they shared life on the street or by a burning desire to find a better life— and maybe get some payback on all the rich people who treated them badly.",
    "PartitionKey": "core",
    "RowKey": "b8680515-96c9-4919-8bc6-4a10e2c46992",
    "Timestamp": "2018-12-27T21:18:02.934621+00:00",
    "ETag": "W/\"datetime'2018-12-27T21%3A18%3A02.934621Z'\""
  },
  {
    "proficiencyOptions": "[\"Investigation\",\"Insight\",\"Perception\",\"Persuasion\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "{\"diceType\":6,\"name\":\"Reason\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Emissary\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Exile\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Fugitive\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Pilgrim\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Sightseer\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Wanderer\"}]}",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Empathic\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Investigator\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Perceptive\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Charming Persona\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Entertaining Competitor\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Linguist\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Athlete\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Practiced\"}]}",
    "personalityTraits": "{\"diceType\":6,\"name\":\"Personality Trait\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I have different assumptions from those around me concerning personal space, invading others' space in innocence, or reacting to invasion of my own.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I have my own ideas about food, and I find the eating habits of others fascinating, confusing, or revolting.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I have a strong code of honor or sense of propriety that others don't comprehend.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I express affection or contempt in ways that are unfamiliar to others.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I honor my deities through practices that are foreign to this land.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I begin or end my day with small traditional rituals that are unfamiliar to those around me.\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"**Open.** I have much to learn from the kindly folk I meet along my way. (Light)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"**Reserved.** As someone new to these strange lands, I am cautious and respectful in my dealings. (Lawful)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"**Adventure.** I'm far from home, and everything is strange and wonderful! (Chaotic)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"**Cunning.** Though I may not know their ways, neither do they know mine, which can be to my advantage. (Dark)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"**Inquisitive.** Everything is new, but I have a thirst to learn. (Neutral)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"**Suspicious.** I must be careful, for I have no way of telling friend from foe here. (Any)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"So long as I have this token from my homeland, I can face any adversity in this strange land.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"The gods of my people are a comfort to me so far from home.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I hold no greater cause than my service to my people.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"My freedom is my most precious possession. I'll never let anyone take it from me again.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I'm fascinated by the beauty and wonder of this new land.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Though I had no choice, I lament having to leave my loved one(s) behind. I ho pe to see them again one day.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I am secretly (or not so secretly) convinced of the superiority of my own culture over that of this foreign land.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I pretend not to understand the local language in order to avoid interactions I would rather not have.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I have a weakness for the new intoxicants and other pleasures of this land.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I don't take kindly to some of the actions and motivations of folk different from me.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I consider the adherents of other gods to be deluded innocents at best, or ignorant fools at worst.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I have a weakness for the exotic beauty of the people of these lands.\"}]}",
    "name": "Far Traveler",
    "description": "Almost all of the common people and other folk that one might encounter throughout the galaxy have one thing in common: they live  their lives without traveling more than a few miles from where they were born.\\n\\nYou aren't one of those folk.\\n\\nYou are from a distant place, one so remote that few of the common folk realize that it exists, and chances are good that even if some people you meet have heard of your homeland, they know merely the name and perhaps a few outrageous stories.\\n\\nAlthough you find some of this land's ways to be strange and discomfiting, you can also be sure that some things its people take for granted will be, to you, new wonders that you've never laid eyes on before. By the same token, you're a person of interest, for good or ill, to those around you almost anywhere you go.",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Insight, Investigation, Perception, and Persuasion",
    "toolProficiencyMarkdown": "Any one musical instrument or gaming set of your choice, likely something native to your homeland",
    "languages": 0,
    "languageMarkdown": "One of your choice",
    "equipmentMarkdown": "One set of traveler's clothes, any one musical instrument or gaming set you are proficient with, poorly wrought maps from your homeland, a small piece of jewelry worth 100 cr in the style of your homeland's craftsmanship, and a pouch containing 50 cr",
    "specialityName": "Why Are You Here?",
    "specialityMarkdown": "To determine why you are so far from home, roll on the table below or choose from the options provided. ",
    "featureName": "All Eyes On You",
    "featureMarkdown": "Your foreign nature attracts attention, yielding access to people and places you might not otherwise have, for you and your traveling companions. Noble lords, scholars, and merchant princes, to name a few, might be interested in hearing about your distant homeland and people.",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "The distance you've traveled manifests itself in the way you speak and carry yourself.",
    "PartitionKey": "core",
    "RowKey": "ceeea5aa-2f70-4e8c-8aff-6c603ec3624e",
    "Timestamp": "2018-12-27T21:18:00.9352133+00:00",
    "ETag": "W/\"datetime'2018-12-27T21%3A18%3A00.9352133Z'\""
  },
  {
    "proficiencyOptions": "[\"Athletics\",\"Investigation\",\"Piloting\",\"Persuasion\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Brawny\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Investigator\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Charming Persona\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Ace Pilot\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Entertaining Competitor\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Linguist\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Weapon Expert\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Durable\"}]}",
    "personalityTraits": "{\"diceType\":8,\"name\":\"Personality Traits\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I do not fear death, but accept it as part of life.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I have a crude sense of humor.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I face problems head-on. A simple, direct solution is the best path to success.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I find it good luck to have a flask of ale on me even when the most of my other belongings are gone.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I ask a lot of questions.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I never pass up a friendly wager.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"I am always polite and respectful when speaking to those above my station.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"I like a job well done, especially if I'm not the one doing it.\"},{\"minValue\":1,\"maxValue\":1,\"result\":\"I'm always polite and respectful.\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"**Greed.** I'm only doing it for the money. (Dark)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"**Fairness.** We all did the work. it is only right that everyone gets a share of the reward. (Lawful)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"**Live and Let Live.** You may not have a family left, but your enemy may. A little compassion goes a long way. (Light)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"**Measure of Last Resort.** Sometimes we have to do things that we REALLY don't want to do, but we must remember that we only do them because we have to. (Chaotic)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"**Debts.** I never leave a favor left undone and nor will I leave those whom owe me favors on the hook. (Neutral)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"**Aspiration.** I have heard a tale of a legendary person of my class. I strive to be more like them. (Any)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I have a personal debt that must be paid.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I am with friends whom I trust with my life as they should trust me with theirs.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I come from a family that dislikes weaknesses, so I push myself to know my weaknesses.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"My life is my honor. I shall, until death, shape my life to what I want it to be.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Without a purpose in the world, I find myself to be broken which I do not like.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I secretly pursue a love interest that is forbidden by a family whether it is my own or my love's family.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I am always looking for the bigger pay.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I can't tell a lie for the life of me.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I judge too easily by special appearance and pride.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I am almost always carrying some ale in with my gear.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I believe that I am the only skilled person of the group and am even open about it.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I will never let a comrade stand alone, even if it gets me killed.\"}]}",
    "name": "Mercenary",
    "description": "As a sell-sword who fought battles for coin, you're well acquainted with risking life and limb for a chance at a share of treasure. Now, you look forward to fighting foes and reaping even greater rewards as an adventurer. Your experience makes you familiar with the ins and outs of mercenary life, and you likely have harrowing stories of events on the battlefield. You might have served with a large outfit or a smaller band of sell-swords, maybe even more than one. \\n\\nNow you're looking for something else, perhaps greater reward for the risks you take, or the freedom to choose your own activities. For whatever reason, you're leaving behind the life of a soldier for hire, but your skills are undeniably suited for battle, so now you fight on in a different way.",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Athletics, Investigation, Persuasion, and Piloting",
    "toolProficiencyMarkdown": "One type of gaming set",
    "languages": 0,
    "languageMarkdown": "One of your choice",
    "equipmentMarkdown": "A uniform of your company (traveler's clothes in quality), an insignia of your rank, a gaming set (one of your choice), and a pouch containing the remainder of your last wages (100 cr)",
    "specialityName": null,
    "specialityMarkdown": null,
    "featureName": "Mercenary Life",
    "featureMarkdown": "You know the mercenary life as only someone who has experienced it can. You are able to identify mercenary companies by their emblems, and you know a little about any such company, including the names and reputations of its commanders and leaders, and who has hired them recently. You can find the cantinas and feasthalls where mercenaries abide in any area, as long as you speak the language, and if you spend at least an hour in such a location you can come across one of the following bits of information: a job offer, significant rumor, referal to a skilled merchant, blacksmith, etc., or a hint towards the pursuit of your current quest. Additionally, you can find mercenary work between adventures sufficient to maintain a comfortable lifestyle (see \"Practicing a Profession\" under \"Downtime Activities\" in chapter 8 of the Player's Handbook).",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "Mercenaries are shaped by their lively nature, for the better and the worse. They tend to be driven by either their commitment to money or something more valuable.",
    "PartitionKey": "core",
    "RowKey": "db47bdc4-4362-4a1c-a522-babb9d5ba37b",
    "Timestamp": "2018-12-24T05:15:49.6071+00:00",
    "ETag": "W/\"datetime'2018-12-24T05%3A15%3A49.6071Z'\""
  },
  {
    "proficiencyOptions": "[\"Athletics\",\"Insight\",\"Persuasion\",\"Technology\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Brawny\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Empathic\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Charming Persona\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Techie\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Crafter\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Linguist\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Biochemist\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Gourmand\"}]}",
    "personalityTraits": "{\"diceType\":8,\"name\":\"Personality Trait\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I believe that anything worth doing is worth doing right. I can’t help it— I’m a perfectionist.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I’m a snob who looks down on those who can’t appreciate fine art.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I always want to know how things work and what makes people tick.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I’m full of witty aphorisms and have a proverb for every occasion.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I’m rude to people who lack my commitment to hard work and fair play.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I like to talk at length about my profession.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"I don’t part with my money easily and will haggle tirelessly to get the best deal possible.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"I believe I’m well known for my work, and I'm always taken aback when people haven’t heard of me.\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"**Community.** It is the duty of all civilized people to strengthen the bonds of community and the security of civilization. (Lawful)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"**Generosity.** My talents were given to me so that I could use them to benefit the world. (Light)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"**Freedom.** Everyone should be free to pursue his or her own livelihood. (Chaotic)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"**Greed.** I’m only in it for the money. (Dark)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"**People.** I’m committed to the people I care about, not to ideals. (Neutral)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"**Aspiration.** I work hard to be the best there is at my craft. (Any)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"The workshop where I learned my trade is the most important place in the world to me.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I created a great work for someone, and then found them unworthy of it; I now search for someone worthy.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I owe my guild a great debt for forging me into the person I am today.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I pursue wealth to secure someone’s love.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"One day I will return to my guild and prove that I am the greatest artisan of them all.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I will get revenge on the Dark forces that destroyed my place of business and ruined my livelihood.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I’ll do anything to get my hands on something rare or priceless.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I’m quick to assume that someone is trying to cheat me.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"No one must ever learn that I once stole money from guild coffers.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I’m never satisfied with what I have— I always want more.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I would kill to acquire a noble title.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I’m horribly jealous of anyone who can outshine my handiwork. Everywhere I go, I’m surrounded by rivals.\"}]}",
    "name": "Guild Artisan",
    "description": "You are a member of an artisan’s guild, skilled in a particular field and closely associated with other artisans. You are a well-established part of the mercantile world, freed by talent and wealth from the constraints of a feudal social order. You learned your skills as an apprentice to a master artisan, under the sponsorship of your guild, until you became a master in your own right.",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Athletics, Insight, Persuasion, and Technology",
    "toolProficiencyMarkdown": "One type of artisan’s tools, biochemist's kit, or chef's kit",
    "languages": 0,
    "languageMarkdown": "One of your choice",
    "equipmentMarkdown": "A set of tools (one of your choice), a letter of introduction from your guild, a set of traveler’s clothes, and a belt pouch containing 150 cr",
    "specialityName": null,
    "specialityMarkdown": null,
    "featureName": "Guild Membership",
    "featureMarkdown": "As an established and respected member of a guild, you can rely on certain benefits that membership provides. Your fellow guild members will provide you with lodging and food if necessary, and pay for your funeral if needed. In some cities and towns, a guildhall offers a central place to meet other members of your profession, which can be a good place to meet potential patrons, allies, or hirelings.\\n\\nGuilds often wield tremendous political power. If you are accused of a crime, your guild will support you if a good case can be made for your innocence or the crime is justifiable. You can also gain access to powerful political figures through the guild, if you are a member in good standing. You must pay dues of 50 cr per month to the guild. Your dues must be current to remain in the guild’s good graces.",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "Guild artisans are among the most ordinary people in the world—until they set down their tools and take up an adventuring career. They understand the value of hard work and the importance of community, but they’re vulnerable to sins of greed and covetousness.",
    "PartitionKey": "core",
    "RowKey": "dca6be9b-b4ad-4edb-b161-1df8373b44e2",
    "Timestamp": "2018-12-27T21:18:01.546643+00:00",
    "ETag": "W/\"datetime'2018-12-27T21%3A18%3A01.546643Z'\""
  },
  {
    "proficiencyOptions": "[\"Athletics\",\"Intimidation\",\"Piloting\",\"Persuasion\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "{\"diceType\":8,\"name\":\"Specialty\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Officer\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Scout\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Infantry\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Medic\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Quartermaster\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Pilot\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Artisan\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Support Staff\"}]}",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Brawny\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Threatening\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Charming Persona\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Ace Pilot\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Entertaining Competitor\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Linguist\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Weapon Expert\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Healer\"}]}",
    "personalityTraits": "{\"diceType\":8,\"name\":\"Personality Trait\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I'm always polite and respectful.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I’m haunted by memories of war. I can’t get the images of violence out of my mind.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I’ve lost too many friends, and I’m slow to make new ones.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I’m full of inspiring and cautionary tales from my military experience relevant to almost every combat situation.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I can stare down a hell hound without flinching.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I enjoy being strong and like breaking things.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"I have a crude sense of humor.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"I face problems head-on. A simple, direct solution is the best path to success.\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"**Greater Good**. Our lot is to lay down our lives in defense of others. (Light)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"**Responsibility**. I do what I must and obey just authority. (Lawful)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"**Independence**. When people follow orders blindly, they embrace a kind of tyranny. (Chaotic)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"**Might**. In life as in war, the stronger force wins. (Dark)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"**Live and Let Live**. Ideals aren’t worth killing over or going to war for. (Neutral)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"**Nation**. My city, nation, or people are all that matter. (Any)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I would still lay down my life for the people I served with.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Someone saved my life on the battlefield. To this day, I will never leave a friend behind.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"My honor is my life.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I’ll never forget the crushing defeat my company suffered or the enemies who dealt it.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Those who fight beside me are those worth dying for.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I fight for those who cannot fight for themselves.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"The monstrous enemy we faced in battle still leaves me quivering with fear.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I have little respect for anyone who is not a proven warrior.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I made a terrible mistake in battle cost many lives— and I would do anything to keep that mistake secret.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"My hatred of my enemies is blind and unreasoning.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I obey the law, even if the law causes misery.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I’d rather eat my armor than admit when I’m wrong.\"}]}",
    "name": "Soldier",
    "description": "War has been your life for as long as you care to remember. You trained as a youth, studied the use of weapons and armor, learned basic survival techniques, including how to stay alive on the battlefield. You might have been part of a standing national army, a mercenary company, or perhaps a member of a local militia who rose to prominence during a recent war.\\n\\nWhen you choose this background, work with your DM to determine which military organization you were a part of, how far through its ranks you progressed, and what kind of experiences you had during your military career. Was it a standing army, a town guard, a village militia, or perhaps a private company.",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Athletics, Intimidation, Persuasion, and Piloting",
    "toolProficiencyMarkdown": "One type of gaming set",
    "languages": 0,
    "languageMarkdown": "One of your choice",
    "equipmentMarkdown": "An insignia of rank, a trophy taken from a fallen enemy, a gaming set (one of your choice), a set of common clothes, and a belt pouch containing 100 cr",
    "specialityName": "Specialty",
    "specialityMarkdown": "During your time as a soldier, you had a specific role to play in your unit or army. Roll a d8 or choose from the options in the table below to determine your role:",
    "featureName": "Military Rank",
    "featureMarkdown": "You have a military rank from your career as a soldier. Soldiers loyal to your former military organization still recognize your authority and influence, and they defer to you if they are of a lower rank. You can invoke your rank to exert influence over other soldiers and requisition simple equipment for temporary use. You can also usually gain access to friendly military encampments where your rank is recognized.",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "The horrors of war combined with the rigid discipline of military service leave their mark on all soldiers, shaping their ideals, creating strong bonds, and often leaving them scarred and vulnerable to fear, shame, and hatred.",
    "PartitionKey": "core",
    "RowKey": "e10602a2-ca19-4e3b-9d4b-e1932072ef57",
    "Timestamp": "2018-12-24T05:15:50.3636383+00:00",
    "ETag": "W/\"datetime'2018-12-24T05%3A15%3A50.3636383Z'\""
  },
  {
    "proficiencyOptions": "[\"Insight\",\"Intimidation\",\"Lore\",\"Perception\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Empathic\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Threatening\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Loremaster\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Perceptive\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Crafter\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Linguist\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Alert\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Observant\"}]}",
    "personalityTraits": "{\"diceType\":8,\"name\":\"Personality Trait\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I ignore the rhetoric a person spouts when meeting them, preferring to judge them by action.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I’m the first to swing a punch, but the last to draw a weapon.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Danger is my middle name.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Goodwill is in short supply in the galaxy, and I always try to foster a little more wherever I go.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Both the Republic and the Empire have tried to crush us under their bootheels. I refuse to yield.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Defiant to the last isn’t good enough. Upon death I will become a force spirit and continue to defy my killer.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Well-behaved people rarely make history.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"What gave you the idea that I was going to give you a fair fight?\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"**Respect.** Respect will be shown to everyone, disrespect will be shown to those who earn it. (Lawful)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"**Freedom.** People should be free to make their own way without interference. (Chaotic)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"**Growth.** Self-improvement is an unending chore, but one that must be done. (Any)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"**Escalation.** I will immediately end a hostile situation with all means at my disposal. (Neutral)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"**Power.** Given our luck with both Jedi and Sith, I need all I can get. (Dark)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"**Redemption.** There’s a spark of good in everyone. (Light)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"The Jensaarai took me in when nobody else would. I back the order 100%.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I was once a Jedi, but grew disillusioned by their inactivity.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I fight for those who cannot fight for themselves.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I lost my mentor in battle. I will honor their sacrifice by destroying their killer.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I was able to slough off Dark Side corruption, but I couldn’t avoid making amends.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"The powerful use their strength to raise people up, not keep them down.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I might be a little too enamored with force choking my enemies.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I am my own worst critic, in everything I do.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"My armor is precision crafted and has served me faithfully. I never give up a chance to prove how well.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I have a collection of lightsabers from fallen foes, and I love adding to it.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"The Jedi and Sith worship the Force as a religion. I do everything I can to remind them they’re just worshipping a hammer.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"The minute you tell me that someone should not be crossed, I’m already crossing them.\"}]}",
    "name": "Jensaarai",
    "description": "You are a Jensaarai, a Force user who has come to understand the failings of both Jedi inactivity and Sith malevolence. While they wield lightsabers, a true mark of skill among the Jensaarai is the crafting of their armor. Each suit is perfectly unique to the wearer, and is frequently (but not always) adorned and shaped to represent an animal that the Jensaarai finds kinship with, up to and potentially including additional mounted weapons or sensors to further emulate that creature.\\n\\nWhile the Jensaarai train in, and will use dark side powers when necessary, they seek to avoid true corruption. They are not evil, nor are they wholly good either. They are anti-heroes, and well-practiced in this craft. In addition, the Jensaarai train in more than the lightsaber, employing whatever tools are at hand to best fit the job.",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Insight, Intimidation, Lore, and Perception",
    "toolProficiencyMarkdown": "Armormech's Tools",
    "languages": 0,
    "languageMarkdown": "One of your choice",
    "equipmentMarkdown": "A set of common clothes including a robe, a sturdy knife, and a belt pouch containing 150 cr",
    "specialityName": null,
    "specialityMarkdown": null,
    "featureName": "Depths of Duality",
    "featureMarkdown": "Due to the corruption of the Jedi training done to the pre-Jensaarai, you have a unique insight into both the Light and Dark side of the Force, as well as its history, applications, and techniques in a scholarly manner.\\n\\nYou fully understand concepts, and can recall key information, The exception being if the research was hidden from the public and you have not had experience working with, in which you may only partially understand. You also recognize well-known Jedi Masters and Sith Lords by their works and marks.",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "Jensaarai are shaped by the unique capacity of their upbringing. Their study of the duality of the Force manifests in their mannerisms and ideals. Their bond might be their family or their armor. Their flaws might be some a hatred of the Jedi or Sith or a desire to become one or the other.",
    "PartitionKey": "core",
    "RowKey": "e4e54cb6-8cea-46f4-9722-87f3810a6295",
    "Timestamp": "2018-12-27T21:18:02.1360586+00:00",
    "ETag": "W/\"datetime'2018-12-27T21%3A18%3A02.1360586Z'\""
  },
  {
    "proficiencyOptions": "[\"Investigation\",\"Insight\",\"Perception\",\"Survival\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Empathic\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Investigator\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Perceptive\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Survivalist\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Linguist\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Alert\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Observant\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Keen Mind\"}]}",
    "personalityTraits": "{\"diceType\":8,\"name\":\"Personality Trait\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I'm always polite and respectful.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I’m haunted by memories of war. I can’t get the images of violence out of my mind.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I’ve lost too many friends, and I’m slow to make new ones.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I’m full of inspiring and cautionary tales from my guard service relevant to almost every combat situation.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I can stare down a hell hound without flinching.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I enjoy being strong and like breaking things.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"I have a crude sense of humor.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"I face problems head-on. A simple, direct solution is the best path to success.\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"**Greater Good**. Our lot is to lay down our lives in defense of others. (Light)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"**Responsibility**. I do what I must and obey just authority. (Lawful)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"**Independence**. When people follow orders blindly, they embrace a kind of tyranny. (Chaotic)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"**Might**. In life as in war, the stronger force wins. (Dark)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"**Live and Let Live**. Ideals aren’t worth killing over or going to war for. (Neutral)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"**Nation**. My city, nation, or people are all that matter. (Any)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I would still lay down my life for the people I served with.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Someone saved my life on the battlefield. To this day, I will never leave a friend behind.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"My honor is my life.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I’ll never forget the crushing defeat my company suffered or the enemies who dealt it.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Those who fight beside me are those worth dying for.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I fight for those who cannot fight for themselves.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"The monstrous enemy we faced in battle still leaves me quivering with fear.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I have little respect for anyone who is not a proven warrior.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I made a terrible mistake in battle cost many lives— and I would do anything to keep that mistake secret.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"My hatred of my enemies is blind and unreasoning.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I obey the law, even if the law causes misery.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I’d rather eat my armor than admit when I’m wrong.\"}]}",
    "name": "Investigator",
    "description": "Rarer than watch or patrol members are a community's investigators, who are responsible for solving crimes after the fact. Though such folk are seldom found in rural areas, nearly every settlement of decent size has at least one or two watch members who have the skill to investigate crime scenes and track down criminals.",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Insight, Investigation, Perception, and Survival",
    "toolProficiencyMarkdown": null,
    "languages": 0,
    "languageMarkdown": "Two of your choice",
    "equipmentMarkdown": "A uniform in the style of your unit and indicative of your rank, a horn with which to summon help, a set of binders, and a pouch containing 100 cr",
    "specialityName": null,
    "specialityMarkdown": null,
    "featureName": "Watcher’s Eye",
    "featureMarkdown": "Your experience in enforcing the law, and dealing with lawbreakers, gives you a feel for local laws and criminals. You can easily find the local outpost of the watch or a similar organization, and just as easily pick out the dens of criminal activity in a community, although you're more likely to be welcome in the former locations rather than the latter.",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "Years of service in the City Watch have led to the rigid discipline most often seen in military service. Working with your comrades has created a strong family bond and pride in your community.",
    "PartitionKey": "core",
    "RowKey": "ea99a328-121d-41d4-bc76-f144175c3bb1",
    "Timestamp": "2018-12-27T21:18:01.9789479+00:00",
    "ETag": "W/\"datetime'2018-12-27T21%3A18%3A01.9789479Z'\""
  },
  {
    "proficiencyOptions": "[\"Animal Handling\",\"Athletics\",\"Nature\",\"Survival\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Animal Handler\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Brawny\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Naturalist\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Survivalist\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Entertaining Competitor\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Crafter\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Athlete\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Weapon Expert\"}]}",
    "personalityTraits": "{\"diceType\":8,\"name\":\"Personality Trait\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I’m driven by a wanderlust that led me away from home.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I watch over my friends as if they were a litter of newborn pups.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I once ran twenty-five miles without stopping to warn to my clan of an approaching orc horde. I’d do it again if I had to.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I have a lesson for every situation, drawn from observing nature.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I place no stock in wealthy or well-mannered folk. Money and manners won’t save you from a hungry owlbear.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I’m always picking things up, absently fiddling with them, and sometimes accidentally breaking them.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"I feel far more comfortable around animals than people.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"I was, in fact, raised by wolves.\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"**Change**. Life is like the seasons, in constant change, and we must change with it. (Chaotic)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"**Greater Good**. It is each person’s responsibility to make the most happiness for the whole tribe. (Light)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"**Honor**. If I dishonor myself, I dishonor my whole clan. (Lawful)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"**Might**. The strongest are meant to rule. (Dark)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"**Nature**. The natural world is more important than all the constructs of civilization. (Neutral)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"**Glory**. I must earn glory in battle, for myself and my clan. (Any)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"My family, clan, or tribe is the most important thing in my life, even when they are far from me.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"An injury to the unspoiled wilderness of my home is an injury to me.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I will bring terrible wrath down on the Darkdoers who destroyed my homeland.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I am the last of my tribe, and it is up to me to ensure their names enter legend.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I suffer awful visions of a coming disaster and will do anything to prevent it.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"It is my duty to provide children to sustain my tribe.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I am too enamored of ale, wine, and other intoxicants.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"There’s no room for caution in a life lived to the fullest.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I remember every insult I’ve received and nurse a silent resentment toward anyone who’s ever wronged me.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I am slow to trust members of other species, tribes, and societies.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Violence is my answer to almost any challenge.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Don’t expect me to save those who can’t save themselves. It is nature’s way that the strong thrive and the weak perish.\"}]}",
    "name": "Barbarian",
    "description": "Though you might have only recently arrived in civilized lands, you are no stranger to the values of cooperation and group effort when striving for supremacy. You learned these principles, and much more, as a member of your tribe.\\n\\nYour people have always tried to hold to the old ways. Tradition and taboo have kept your tribe strong while the kingdoms of others have collapsed into chaos and ruin. But for the last few generations, some bands among the tribes were tempted to settle, make peace, trade, and even to build towns. Perhaps this is why your tribe chose to raise up the totems among the people as living embodiments of his power. Perhaps they needed a reminder of who they were and from whence they came. The Chosen of your tribe led bands back to the old ways, and most of your people abandoned the soft ways of civilization.",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Animal Handling, Athletics, Nature, and Survival",
    "toolProficiencyMarkdown": "One type of musical instrument or artisan's tools",
    "languages": 0,
    "languageMarkdown": "One of your choice",
    "equipmentMarkdown": "A hunting trap, a totemic token or set of tattoos marking your loyalty to your tribe, a set of traveler's clothes, and a pouch containing 100 cr",
    "specialityName": null,
    "specialityMarkdown": null,
    "featureName": "Barbarian Heritage",
    "featureMarkdown": "You have an excellent knowledge of not only your tribe's territory, but also the terrain and natural resources of the rest of the worlds. You are familiar enough with any wilderness area that you find twice as much food and water as you normally would when you forage there.\\n\\nAdditionally, you can call upon the hospitality of other tribes in times of need.",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "Often considered rude and uncouth among civilized folk, barbarians have little respect for the niceties of life in the cities. The ties of tribe, clan, family, and the natural world of which they are a part are the most important bonds to most outlanders. ",
    "PartitionKey": "core",
    "RowKey": "ec47dbe8-bdce-4b07-bc32-849197e9250e",
    "Timestamp": "2018-12-27T21:18:00.0505898+00:00",
    "ETag": "W/\"datetime'2018-12-27T21%3A18%3A00.0505898Z'\""
  },
  {
    "proficiencyOptions": "[\"Athletics\",\"Medicine\",\"Perception\",\"Piloting\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "{\"diceType\":8,\"name\":\"Specialization\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Trooper\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Commando\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Jet Trooper\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Medic\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Spec Ops\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Ordnance\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Officer\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Scout\"}]}",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Brawny\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Medic\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Perceptive\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Ace Pilot\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Demolitionist\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Bypasser\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Slicer\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Martial Adept\"}]}",
    "personalityTraits": "{\"diceType\":8,\"name\":\"Personality Trait\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I always respect my commander.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I can stare down a krayt dragon without flinching.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I face problems head-on. A simple, direct solution is the best path to success.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I have a sense of humor. This is rare among my brothers.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I judge people by their actions, not their words.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I’ve lost too many friends, and I’m slow to make new ones.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"I ask a lot of questions.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"I’ll settle for nothing less than perfection.\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"**Responsibility**. I do what I must and obey just authority. (Lawful)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"**Might**. Strength, not compassion, wins battles. (Dark)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"**Republic**. My brothers, the Republic, or people are all that matter. (Any)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"**Greater Light**. We fight not for ourselves, but for countless of others that can’t fight for themselves. (Light)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"**Freedom**. Tyrants must not be allowed to oppress the people. (Chaotic)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"**Live and Let Live**. Ideals aren’t worth killing or going to war over. (Neutral)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"My honor is my life.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Someone saved my life on the battlefield. To this day, I will never leave a friend behind.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Those who fight beside me are those worth dying for.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I fight for those who cannot fight for themselves.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I would still lay down my life for the people I serve with.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"A proud commander once gave me a horrible beating, and I will take my revenge on any bully I encounter.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I have little respect for anyone who is of a lesser rank.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I obey the orders without, even if the orders cause misery.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I’d rather eat my armor than admit when I’m wrong.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I judge others harshly, and myself even more severely.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I am inflexible in my thinking.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I can't tell a lie for the life of me.\"}]}",
    "name": "Clone Trooper",
    "description": "You are one of millions; genetically engineered, identical specimens designed to be the perfect soldier. Created from a template provided by the legendary bounty hunter Jango Fett, you represent the latest and greatest evolution in galactic warfare.",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Athletics, Medicine, Perception, and Piloting",
    "toolProficiencyMarkdown": "Your choice of demolitions kit, security kit, or slicer's kit",
    "languages": 0,
    "languageMarkdown": "One of your choice",
    "equipmentMarkdown": "Badge or emblem of your rank, your chosen tools, a set of common clothes, and a pouch containing 100 cr",
    "specialityName": "Clone Specialization",
    "specialityMarkdown": "While most clones serve as simple soldier, there are many specialized units. Roll a d8 or choose from the options in the table below to determine your specialization:",
    "featureName": "Republic Rank",
    "featureMarkdown": "You are a soldier of the Republic. Those loyal to the Republic will respect your status and defer to you if they don't outrank you. You can invoke your position to exert influence over other soldiers, requisition simple equipment, and gain access to military compounds affiliated with the Republic.",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "Clones are trained from birth to be the perfect soldier; over time, they also develop their own personalities. They are universally loyal to the Republic. While clones share genetic coding, no two are completely identical.",
    "PartitionKey": "core",
    "RowKey": "edd7040d-eb31-4090-b372-07c162ed1ca3",
    "Timestamp": "2018-12-27T21:18:00.4798922+00:00",
    "ETag": "W/\"datetime'2018-12-27T21%3A18%3A00.4798922Z'\""
  },
  {
    "proficiencyOptions": "[\"Athletics\",\"Investigation\",\"Insight\",\"Perception\"]",
    "toolOptions": "",
    "languagesLearned": "",
    "specialityOptions": "",
    "featOptions": "{\"diceType\":8,\"name\":\"Background Feat\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"Brawny\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Empathic\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"Investigator\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"Perceptive\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Linguist\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"Alert\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"Athlete\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"Durable\"}]}",
    "personalityTraits": "{\"diceType\":8,\"name\":\"Personality Trait\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I'm always polite and respectful.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I’m haunted by memories of war. I can’t get the images of violence out of my mind.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I’ve lost too many friends, and I’m slow to make new ones.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I’m full of inspiring and cautionary tales from my guard service relevant to almost every combat situation.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I can stare down a hell hound without flinching.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I enjoy being strong and like breaking things.\"},{\"minValue\":7,\"maxValue\":7,\"result\":\"I have a crude sense of humor.\"},{\"minValue\":8,\"maxValue\":8,\"result\":\"I face problems head-on. A simple, direct solution is the best path to success.\"}]}",
    "ideals": "{\"diceType\":6,\"name\":\"Ideal\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"**Greater Good**. Our lot is to lay down our lives in defense of others. (Light)\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"**Responsibility**. I do what I must and obey just authority. (Lawful)\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"**Independence**. When people follow orders blindly, they embrace a kind of tyranny. (Chaotic)\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"**Might**. In life as in war, the stronger force wins. (Dark)\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"**Live and Let Live**. Ideals aren’t worth killing over or going to war for. (Neutral)\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"**Nation**. My city, nation, or people are all that matter. (Any)\"}]}",
    "bonds": "{\"diceType\":6,\"name\":\"Bond\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"I would still lay down my life for the people I served with.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"Someone saved my life on the battlefield. To this day, I will never leave a friend behind.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"My honor is my life.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"I’ll never forget the crushing defeat my company suffered or the enemies who dealt it.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"Those who fight beside me are those worth dying for.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I fight for those who cannot fight for themselves.\"}]}",
    "flaws": "{\"diceType\":6,\"name\":\"Flaw\",\"values\":[{\"minValue\":1,\"maxValue\":1,\"result\":\"The monstrous enemy we faced in battle still leaves me quivering with fear.\"},{\"minValue\":2,\"maxValue\":2,\"result\":\"I have little respect for anyone who is not a proven warrior.\"},{\"minValue\":3,\"maxValue\":3,\"result\":\"I made a terrible mistake in battle cost many lives— and I would do anything to keep that mistake secret.\"},{\"minValue\":4,\"maxValue\":4,\"result\":\"My hatred of my enemies is blind and unreasoning.\"},{\"minValue\":5,\"maxValue\":5,\"result\":\"I obey the law, even if the law causes misery.\"},{\"minValue\":6,\"maxValue\":6,\"result\":\"I’d rather eat my armor than admit when I’m wrong.\"}]}",
    "name": "City Watch",
    "description": "You have served the community where you grew up, standing as its first line of defense against crime and wildlife. You aren't a soldier, directing your gaze outward at possible enemies. Instead, your service to your hometown was to help police its populace, protecting the citizenry from lawbreakers and malefactors of every stripe.\\n\\nEven if you're not city-born or city-bred, this background can describe your early years as a member of law enforcement. Most settlements of any size have their own law enforcement forces.",
    "proficiencyCount": 2,
    "proficiencyMarkdown": "Choose two from among Athletics, Insight, Investigation, and Perception",
    "toolProficiencyMarkdown": null,
    "languages": 0,
    "languageMarkdown": "Two of your choice",
    "equipmentMarkdown": "A uniform in the style of your unit and indicative of your rank, a horn with which to summon help, a set of binders, and a pouch containing 100 cr",
    "specialityName": null,
    "specialityMarkdown": null,
    "featureName": "Watcher’s Eye",
    "featureMarkdown": "Your experience in enforcing the law, and dealing with lawbreakers, gives you a feel for local laws and criminals. You can easily find the local outpost of the watch or a similar organization, and just as easily pick out the dens of criminal activity in a community, although you're more likely to be welcome in the former locations rather than the latter.",
    "backgroundFeatMarkdown": "As a further embodiment of the experience and training of your background, you can choose from the following feats:",
    "suggestedCharacteristicsMarkdown": "Years of service in the City Watch have led to the rigid discipline most often seen in military service. Working with your comrades has created a strong family bond and pride in your community.",
    "PartitionKey": "core",
    "RowKey": "efd5d403-d437-48e8-8742-906f84deed79",
    "Timestamp": "2018-12-27T21:18:00.346798+00:00",
    "ETag": "W/\"datetime'2018-12-27T21%3A18%3A00.346798Z'\""
  }
]
